using System;
using System.Collections.Generic;
using System.Data;
using System.Linq;
using System.Reflection;
using System.Text;

namespace Young.Core.Data
{

    /// <summary>
    /// 数据类型安全转换
    /// </summary>
    public class ConvertSafe
    {
        #region (public) 字符型转Decimal _Stringt2Decimal

        /// <summary>
        /// 字符型转Decimal (出错返回0)
        /// </summary>
        /// <param name="strValue">输入字符串</param>
        /// <returns></returns>
        public static decimal _Stringt2Decimal(string strValue)
        {
            try
            {
                return decimal.Parse(strValue);
            }
            catch
            {
                return 0;
            }
        }

        #endregion

        #region (public) Decimal 精确到整数，只入不舍。_Decimal2Decimal

        /// <summary>
        /// Decimal按小数第一位只入不舍，例如：参数为10.1 则返回11 (异常出错返回0)
        /// </summary>
        /// <param name="strValue">输入字符串</param>
        /// <returns></returns>
        public static decimal _Decimal2Decimal(decimal dcmValue)
        {
            try
            {
                decimal dcmWholeNumber= Math.Round(dcmValue, 0);
                if (dcmWholeNumber<dcmValue)
                    return dcmWholeNumber+1;
                else return dcmWholeNumber;
            }
            catch
            {
                return 0;
            }
        }

        #endregion

        #region (public) 字符型转布尔型 _String2Bool

        /// <summary>
        /// 字符型转布尔型 (错误返回 false)
        /// </summary>
        /// <param name="strValue">输入值</param>
        /// <returns></returns>
        public static bool _String2Bool(string strValue)
        {
            try
            {
                return Boolean.Parse(strValue);
            }
            catch
            {
                return false;
            }
        }

        #endregion

        #region （public）将DateTime时间格式转换为Unix时间戳格式 _ConvertDateTimeInt
        /// <summary>
        /// 将c# DateTime时间格式转换为Unix时间戳格式
        /// </summary>
        /// <param name="time">时间</param>
        /// <returns>double</returns>
        public static long _ConvertDateTimeInt(System.DateTime time)
        {
            double intResult = 0;
            System.DateTime startTime = TimeZone.CurrentTimeZone.ToLocalTime(new System.DateTime(1970, 1, 1));
            intResult = (time - startTime).TotalSeconds;
            return (long)intResult;
        }
        #endregion

        #region （public） Unix 时间戳转换成 DateTime时间格式 _UTCSecondsToDataTime
        /// <summary>
        /// 将c# Unix 时间戳转换成 DateTime时间格式
        /// </summary>
        /// <param name="seconds">秒数</param>
        /// <returns>double</returns>
        public static DateTime _UTCSecondsToDataTime(long seconds)
        {
            return new System.DateTime(1970, 1, 1).ToLocalTime().AddSeconds(seconds);
        }
        #endregion

        #region （public） 汉字转换成拼音 _ConvertHanZiToPinYin
        /// <summary>
        /// 汉字转换成拼音
        /// </summary>
        /// <param name="str">汉字</param>
        /// <returns>拼音</returns>
        public static string _ConvertHanZiToPinYin(string strHanZi)
        {
            if (string.IsNullOrEmpty(strHanZi))
                return null;
            Encoding ed = Encoding.GetEncoding("GB2312");
            if (ed == null)
                throw (new ArgumentException("没有找到编码集GB2312"));
            char[] charary = strHanZi.ToCharArray();
            byte[] bAry = new byte[2];
            StringBuilder rtnSb = new StringBuilder();
            for (int i = 0; i < charary.Length; i++)
            {

                bAry = ed.GetBytes(charary[i].ToString());
                if (bAry.Length == 1)
                {
                    rtnSb.Append(charary[i]);
                    continue;
                }
                bool isFind = false;
                for (int j = 0; j < _Allhz.Length; j++)
                {
                    if (_Allhz[j][1].IndexOf(charary[i]) != -1)
                    {
                        rtnSb.Append(_Allhz[j][0]);
                        isFind = true;
                        break;
                    }
                }
                if (!isFind)
                    rtnSb.Append(charary[i]);

            }
            return rtnSb.ToString();
        }

        #region 所有拼音对应的汉字
        //数据来源于在线新华字典http://xh.5156edu.com/
        //数据由闫献洲进行校正，历时两天
        private static readonly string[][] _Allhz = new string[][]
        {
        new string[]{"A","吖阿啊锕錒厑呵腌嗄嬶"},
        new string[]{"Ai","艾阨伌佁毐哎哀诶昹爱砹唉娭挨埃捱娾啀硋皑欸閊隘溾凒塧溰嫒嗳嗌矮愛碍魞瑷暧锿嘊蔼叆敱敳僾躷皚鴱薆噫噯壒懓嬡濭懝騃癌餲鎄曖璦皧瞹馤霭譪礙藹﨟譺鑀鱛鱫靄靉"},
        new string[]{"An","厂屵犴安侒岸峖按洝垵玵荌俺胺桉案氨豻铵谙埯堓偣菴婩隌庵唵啽媕萻葊揞晻暗腤雸痷鹌罯誝貋銨蓭鞍鞌盦錌諳儑闇馣鮟盫鵪鶕韽黯"},
        new string[]{"Ang","卬仰岇枊昂肮昻盎骯醠"},
        new string[]{"Ao","艹夭凹芺岙抝拗垇坳岰柪袄敖梎镺軪媪傲厫隞奡奥奧廒嗷嗸蔜遨媼嫯獓嶅慠滶骜熬獒摮璈澚澳懊墺嶴磝螯聱翱擙翶謷謸襖鳌鏊翺嚣鏖爊驁鷔鰲鱜鼇"},
        new string[]{"Ba","丷八仈巴叐叭扒朳玐坝岜把扷抜吧夿弝芭伯茇拔妭爸杷柭胈癹钯疤炦垻捌哵蚆耙粑罢笆釟豝跁菝跋詙鈀鈨軷鲃鲅靶魃颰罷鮁羓鎺鯐鼥覇矲霸壩灞欛"},
        new string[]{"Bai","白百伯庍呗佰拝败陌拜柏挀栢瓸竡敗捭猈掰粨絔稗兡摆粺薭擺贁韛犤襬"},
        new string[]{"Ban","办半阪伴岅扳扮坂坢怑板版攽昄瓪拌姅肦绊钣柈班秚粄般舨絆湴斑鈑鉡頒斒搬蝂靽鳻魬螁瘢螌褩辦颁闆癍辬瓣"},
        new string[]{"Bang","邦玤帮挷绑垹捠旁梆蚌浜邫綁棒棓幇傍谤蒡搒塝稖膀蜯榜牓幚镑磅縍艕謗幫鎊鞤"},
        new string[]{"Bao","勹勽包刨佨报抱怉孢饱宝苞保炮枹胞鸨窇铇宲剥剝珤豹趵蚫笣菢葆媬堡報堢煲寚龅鉋飽飹鲍雹裦駂鳵骲褓暴蕔髱鴇褒緥虣襃賲鮑闁薄儤曓袌瀑藵寳爆曝犦寶忁齙鑤靌"},
        new string[]{"Bei","贝北陂邶呗狈孛貝昁备杯牬卑苝郥柸背钡盃被悖倍俻狽唄偝偹鄁桮梖珼琲惫辈焙棓椑悲備僃揹軰蛽鹎碑碚禙鉳蓓愂犕鞁骳褙誖輩鋇糒憊臂藣鞴鵯鐾"},
        new string[]{"Ben","夯本坌奔苯泍贲畚奙倴捹渀逩翉笨桳犇锛楍撪錛"},
        new string[]{"Beng","伻祊泵迸甭甮蚌埄埲绷逬奟菶崩揼琫琣絣閍痭嵭嘣塴綳镚甏繃鞛蹦鏰"},
        new string[]{"Bi","匕币比必毕朼闭夶迊庇吡邲佊佖诐芘妣沘坒皀疕畀畁毞泌怭怶妼彼屄苾咇哔荜陛柲柀贲毖珌疪秕秘铋畢袐舭笓粃粊毙笔狴俾荸萆萞萙偪啚庳婢敝梐閉閇賁貱詖筆筚蛯皕禆毴赑堛愊愎湢逼弼弻彃嗶鄙蓖蓽滗滭煏楅榌腷睥睤痹痺蜌裨辟跸閟飶鉍馝聛綼箄箅箆碧熚獙蔽鄪幣弊鼻貏幤潷罼獘豍髲駜觱縪篦篳螕嬖壁廦避薜鵖鮅斃濞臂蹕鲾髀鎞鏎饆鄨璧奰襣襞繴魓韠鞸驆躄躃鰏鷝贔鐴朇鷩鼊"},
        new string[]{"Bian","卞边弁苄抃汳汴忭釆贬炞玣峅变便砭昪扁窆変覍貶笾匾遍徧揙萹猵惼编缏甂煸牑閞褊辡碥稨蝙糄緶編艑箯諚鞕鴘辨辩辧辫鳊鍽獱藊邉邊鞭鯿鯾辮辯變籩"},
        new string[]{"Biao","杓标骉飑表髟俵婊彪淲猋脿裱嫑骠蔈滮摽幖墂颮鋲諘麃熛膘標镖褾瘭磦飙飚錶颷儦檦藨瀌謤鳔鏢臕贆爂镳穮飆飇飈飊鑣驫"},
        new string[]{"Bie","别別莂蛂徶彆憋瘪襒蟞蹩鳖癟鱉鼈虌龞"},
        new string[]{"Bin","邠玢宾彬梹椕傧斌缤摈滨殡槟膑瑸賓賔豩髩镔頻儐濒濱濵擯豳虨鬂璸臏殯檳瀕霦髌繽蠙鬓鑌髕顮鬢"},
        new string[]{"Bing","冫仌丙氷并冰邴陃兵苪並幷併抦怲秉炳柄屏饼垪昞昺庰倂绠竝眪病栟栤窉蛃掤偋傡寎摒棅禀誁鈵稟鞆鉼餅槟餠鞞鮩靐"},
        new string[]{"Bo","卜仢癶孛肑伯驳狛帛拨波泊瓝畓胉柏侼郣勃玻趵盋般剥亳浡挬哱饽袯砵瓟秡钵钹铂袹脖啵淿菠萡舶缽紴跛鹁葧渤溊博馎愽碆搏猼鉢鈸鉑鲅鲌魄馛駁艊箔蔔僰僠煿膊牔镈蕃嶓播撥踣餑鋍馞駮鮊薄孹擘檗/font>襏濹謈簙餺鎛鵓嚗礡懪髆髉簸糪譒蹳欂襮蘗礴驋鱍鑮"},
        new string[]{"Bu","卜不卟布吥佈步补歨歩怖咘巭钚柨钸庯悑哺峬捕捗埔埗荹逋部勏埠晡瓿補堡鈈鈽鳪蔀廍誧踄餔郶篰餢錻鵏簿轐醭鸔"},
        new string[]{"Ca","乲拆遪嚓擦攃礤礸"},
        new string[]{"Cai","才财材采財倸宷寀婇猜彩偲菜啋採埰棌睬跴綵蔡踩縩裁纔"},
        new string[]{"Can","灿参残蚕飡參叄骖惭惨掺湌喰孱叅朁殘粲傪慚慘蝅憯慙儏嬠薒澯穇餐燦篸璨謲黪爘驂黲蠺蠶"},
        new string[]{"Cang","仓仺伧苍沧鸧舱倉傖凔蒼獊嵢滄臧螥濸艙賶藏鶬鑶"},
        new string[]{"Cao","艸肏草曺曹愺慒漕蓸嘈嶆撡鄵槽糙褿懆操螬艚襙鏪騲鼜"},
        new string[]{"Ce","夨册冊侧厕荝拺测恻敇硛粣笧萗厠側猠惻測廁萴策筴筞蓛箣憡簎"},
        new string[]{"Cen","岑参笒涔埁梣嵾"},
        new string[]{"Ceng","层曾層噌嶒竲蹭驓"},
        new string[]{"Ceok","硛硳"},
        new string[]{"Ceon","猠"},
        new string[]{"Cha","叉奼扱扠汊岔杈诧刹侘衩臿紁剎姹茬茶差咤查査秅垞挿偛猹嗏喳插搽揷嵖馇靫詫詧楂槎锸碴察銟艖蹅疀嚓鍤餷檫镲鑔"},
        new string[]{"Chai","袃芆犲肞钗拆侪差虿訍豺柴茝釵祡喍瘥儕蠆囆"},
        new string[]{"Chan","产辿忏旵刬苂单丳斺觇浐剗谄梴掺铲產産硟谗阐婵蒇湹禅搀棎孱馋覘裧煘缠剷僝滻獑摻摲摌蝉誗鋋鋓閳諂緾嬋蕆骣潺潹儃廛幝幨澶磛燀毚螹鄽簅襜醦冁瀍蟬繟懴蟾酁劖儳鏟譂闡嚵瀺巉懺壥攙欃纏纒镵囅躔韂顫讇灛艬讒羼颤饞鑱"},
        new string[]{"Chang","厂长仧仩伥场兏怅苌玚肠镸畅長昌昶尝鬯倡倘倀偿菖萇徜常唱惝悵阊娼猖淐瓺琩場焻椙敞腸甞锠裮畼裳暢塲嫦厰嘗僘廠誯膓瑺鋹錩閶鲳氅嚐償鲿韔蟐鯧鼚鱨"},
        new string[]{"Chao","仦仯吵抄弨炒怊钞牊欩晁眧耖觘訬绰巢巣焯超鈔焣朝剿鄛鼌煼漅潮樔嘲麨窲窼罺鼂轈謿巐"},
        new string[]{"Che","屮尺车伡彻扯車坼迠俥砗偖莗唓烢聅硨硩掣蛼頙撦撤澈徹勶瞮爡"},
        new string[]{"Chen","伧尘臣辰忱陈沉迧抻衬疢茞莀莐郴陳栕烥宸称龀趻軙訦晨敐桭捵谌愖棽琛硶趁趂鈂碜煁榇嗔蔯墋塵樄敶瘎綝賝諃瞋霃夦踸齓磣諶螴謓齔鍖薼儭麎贂嚫谶曟櫬襯鷐讖"},
        new string[]{"Cheng","成乘盛撑称城程呈诚惩逞骋澄橙承塍柽埕铖噌铛酲晟裎枨蛏丞瞠乗伥侱倀偁僜净呛嗆埩堘塖娍宬峸嵊庱徎徴徵悜憆憕懲抢挰掁搶摚摤撐撜敞朾棖棦椉槍樘橕橖檉檙氶泟洆浈浧浾淨溗澂瀓瀞爯牚珵珹琤瑲畻盯睈矃碀稱穪窚竀筬絾緽脀脭荿虰蟶觕誠赪赬趟踜蹦郕郢醒鋮鎗鏳鏿鐺阷靗頳饓騁騬鯎黨秤"},
        new string[]{"Chi","彳尺叱叺斥吃伬池弛驰妛迟饬呎杘肔灻赤齿坻侈侙卶茌抶迡持荎勅垑恜炽胣竾耻翅翄胵恥鸱蚩蚇勑哧彨匙蚳袳瓻敕烾粚眵笞豉赿貾飭訵筂欼歯遅湁啻喫嗤傺摛遟媸痴痸裭腟絺雴馳鉓鉹銐翤箎憏瘈遫遲噄瘛慗褫殦墀漦誺翨瞝踟齒鴟篪熾螭謘鵄鍉趩袲懘癡魑鶒齝麶攡彲鷘黐"},
        new string[]{"Chong","冲充虫沖忡宠茺种重翀珫涌浺隀崇崈铳埫舂揰摏嘃漴銃褈蝩憃緟憧罿蟲艟蹖寵爞衝"},
        new string[]{"Chou","丑丒仇吜抽杻杽俦帱栦臭紬菗偢绸惆絒遚畴椆臰詶酬酧裯愁皗稠筹搊殠綢瞅踌雔鮘醜篘瘳儔薵幬懤嬦燽矁檮雠疇籌犨躊醻讎讐魗雦犫"},
        new string[]{"Chu","亍刍出処处岀助初竌怵豖绌泏杵除欪竐础敊畜芻俶椘埱處絀珿禇豠滁楮储傗鄐厨蒢锄雏触鉏蒭楚榋滀搐趎耡蜍褚媰犓摴閦鋤樗廚嘼儊篨諔憷橱濋檚儲斶歜璴臅黜雛礎貙躇蟵幮櫉櫥蹰觸齣鶵躕齭矗齼"},
        new string[]{"Chua","欻"},
        new string[]{"Chuai","啜揣搋嘬膗膪踹"},
        new string[]{"Chuan","巛川传汌舛氚串玔钏穿舡荈舩船剶釧遄喘猭傳歂椽瑏賗僢暷篅輲踳鶨"},
        new string[]{"Chuang","刅创闯怆床刱牀疮剏剙窓窗創傸牎愴摐牕瘡幢噇磢窻闖"},
        new string[]{"Chui","吹炊垂埀桘陲倕菙捶搥棰椎圌腄锤槌箠錘鎚顀龡"},
        new string[]{"Chun","纯旾杶陙春純唇莼浱淳萅偆脣堾媋萶湻犉鹑滣椿槆蒓暙瑃惷睶蓴漘箺醇蝽醕錞賰輴橁櫄鶉鯙鰆鶞蠢"},
        new string[]{"Chuo","辶辵哾娖娕婼婥啜逴涰绰惙辍酫踀綽輟踔龊趠餟磭擉繛戳歠嚽齪鑡"},
        new string[]{"Ci","朿次此伺词佌佽刺刾珁祠柌垐兹泚差庛呲茈茨茦栨瓷玼皉疵莿趀閊赐絘辝詞偨蛓慈甆辞跐雌鹚磁螆骴餈飺辤縒賜糍薋嬨濨鴜鮆礠髊蠀辭鷀鶿齹"},
        new string[]{"Zi","嗭"},
        new string[]{"Cong","从丛匆苁囱囪枞忩茐徔怱従從徖婃淙悤孮悰愡棇琮葱楤憁蔥蓯潀漎漗骢聡聪聦賨賩誴暰潨樅樬瑽璁熜瞛樷錝鍯篵聰蟌藂叢繱謥鏦鏓騘驄灇爜欉"},
        new string[]{"Cou","凑湊辏楱腠輳"},
        new string[]{"Cu","卒徂怚促殂脨粗觕猝酢媨瘄麁趗誎蔟噈憱趣踧麄醋踿瘯橻縬簇鼀蹙蹴蹵顣麤"},
        new string[]{"Cuan","汆菆窜撺殩熶篡簒镩竄蹿櫕攒攛巑欑穳躥鑹爨"},
        new string[]{"Cui","伜忰疩粋脆脃倅翆紣崔萃啐啛淬悴琗脺焠毳缞嵟催凗瘁粹慛摧獕墔漼榱綷翠趡槯璀膵膬皠磪縗顇竁襊濢臎鏙"},
        new string[]{"Cun","寸刌邨忖存村侟籿拵皴踆澊墫竴膥蹲"},
        new string[]{"Cuo","剉剒莝莡挫夎厝脞虘措逪蒫搓嵯嵳锉矬睉痤错瑳蓌遳蔖瘥磋銼撮錯鹾醝蹉鎈酂鹺"},
        new string[]{"Da","大亣打达汏迏迖迚咑呾怛妲沓畓炟垯哒荙荅耷畗眔疸畣惮逹匒剳笪笚答詚搭嗒達塔跶靼褡瘩墶薘噠撘鞑羍鎝鎉繨蟽躂鶎鯳鐽韃龖龘"},
        new string[]{"Dai","大歹歺代呆呔轪甙绐垈骀岱帒侢迨带殆待贷怠柋玳帯貣軑軚蚮紿帶逮埭傣貸軩跢瑇獃廗叇曃蝳緿鴏黛袋艜懛戴簤霴瀻襶黱靆"},
        new string[]{"Dan","丹旦石刐伔但帎妉抌担泹单诞狚沊瓭玬胆眈柦砃衴単唌郸疍耽耼紞疸聃蛋啖啗萏弹淡惮掸躭酖觛弾媅單啿蜑腅氮赕殚瘅窞蓞亶誕頕髧馾噉鄲匰僤褝箪儋勯嘾彈撣撢憚賧餤駳鴠黕憺澹擔殫禫甔癉膽襌簞癚繵聸嚪贉饏霮黮黵"},
        new string[]{"Dang","氹圵凼当宕砀垱挡荡党档珰铛菪裆筜谠婸瓽逿愓當嵣雼潒碭瞊儅蕩趤澢擋噹壋檔盪璫璗襠簜礑簹蟷艡譡黨蘯鐺闣攩灙欓讜"},
        new string[]{"Dao","嶌刀刂辺忉叨朷氘导乭岛到舠陦倒島帱捣釖鱽盗捯悼焘祷菿道禂椡盜﨩魛搗隝嶋槝翢稲稻噵艔導隯檤螩蹈擣壔嶹燾禱翿軇瓙纛嶌"},
        new string[]{"De","地底的恴得淂惪悳棏锝徳嘚德鍀"},
        new string[]{"Dei","得嘚"},
        new string[]{"Den","扥扽"},
        new string[]{"Deng","邓灯登等豋戥鄧隥凳僜噔嬁嶝澄墱璒燈镫竳瞪磴艠櫈簦覴蹬鐙"},
        new string[]{"Di","氐地仾低厎邸阺廸弟诋坘坔狄杕玓旳的籴枤奃怟岻抵拞坻呧弤底彽迪苐苖俤帝埅柢牴敌秪砥袛埊涤递逓唙娣荻菂菧偙隄谛啇啲掋埞梊梑焍祶眱珶笛第釱趆觝詆軧睇靮觌缔棣堤提揥媂蒂僀遞滌楴禘髢馰腣鉪聜碲蝃翟骶頔滴摕墬墑遰嫡嘀蔕蔋蔐甋樀蝭慸敵締踶諦镝嶳藡嚁螮磾羝鞮豴蹢鏑嚸糴覿鸐"},
        new string[]{"Dia","嗲"},
        new string[]{"Dian","电甸阽佃典奌店坫垫点扂敁玷钿婝婰掂淀惦奠厧傎琔敟椣殿蒧滇嵮蜔碘電鈿槇槙墊瘨蕇踮靛澱壂橂點蹎磹簟癜巅顛顚癫巓攧驔颠巔癲齻"},
        new string[]{"Diao","刁弔叼汈鸟扚吊伄刟钓虭屌盄訋窎凋调奝彫弴掉蛁铞铫釣鈟貂琱蓧竨碉鳭雿銱銚魡調窵瞗瘹鮉鲷鋽錭雕藋鼦鯛鵰鑃"},
        new string[]{"Die","苵迭咥哋峌挕绖垤恎胅昳瓞眣耊爹戜谍眰耋畳幉喋惵堞揲絰臷镻詄趃跌跕跮殜叠楪牃牒碟褋蜨嵽蝶艓諜蹀鴩疂螲鲽褺蹛曡鰈疉疊氎"},
        new string[]{"Ding","丁仃订艼帄叮奵饤忊玎钉町盯疔矴虰耵定訂酊釘飣靪頂铤啶萣腚椗鼎锭碇碠嵿鼑顶薡濎錠磸顁鐤"},
        new string[]{"Diu","丢丟铥颩銩"},
        new string[]{"Dong","东冬动冻苳咚岽東侗垌挏洞栋氡恫峒姛昸胨迵鸫胴凍戙倲埬涷動菄娻崬崠笗硐腖董湩氭棟働蝀箽諌懂蕫嬞駧鮗霘鼕鯟鶇鶫"},
        new string[]{"Dou","斗乧阧吋吺抖豆枓钭陡郖剅都读荳浢唗唞饾逗蚪鬥脰酘毭梪渎兜兠痘鈄閗窦蔸鬦餖橷篼斣闘竇鬪鬬鬭"},
        new string[]{"Du","叾厾芏妒杜肚妬独度毒笃荰读剢都阇秺渎堵赌渡椟琽犊牍靯督睹嘟镀裻読覩賭醏獤獨錖篤螙闍斁鍍凟匵殬瀆嬻櫝殰瓄牘犢皾騳黩讀髑韣蠧贕豄鑟蠹韥韇黷讟"},
        new string[]{"Duan","段耑断偳葮媏缎塅短椴煅瑖腶锻端碫褍緞毈簖鍛鍴斷躖籪"},
        new string[]{"Dui","队对兊兌対兑祋怼垖陮隊堆塠敦痽碓綐磓對憞頧錞憝濧鴭镦薱懟瀩譈鐓鐜譵轛"},
        new string[]{"Dun","伅庉吨沌囤炖逇盹盾砘钝趸惇遁鈍敦楯頓碷遯蜳壿撴潡墩墪燉噸犜撉踲顿镦礅蹲蹾躉驐"},
        new string[]{"Duo","夺驮多夛朵朶杕饳沲咄陊陏剁刴哆哚度挅挆垛垜柮柂尮桗铎﨣剟剫埵堕掇崜缍舵敚敓敪毲痥敠鈬惰媠喥飿趓跺跥裰躲躱椯綞奪憜墮墯凙縅踱亸澤嚉鵆鵽鯲鬌軃嚲鐸奲"},
        new string[]{"E","厄仒戹岋讹吪呃厑阿阸苊迗扼囮轭枙呝妸妿砐砈姶咹咢俄峉垩屙饿涐峨峩恶胺莪哦娿婀娥匎砨蚅訛硆珴軛谔偔鄂卾悪阏堊堨堮湂崿惡皒锇愕萼遌遏軶豟鈋鈪睋鹅蛯蛾琧頋廅旕腭搤搹锷僫鹗磀蝁誐頞頟鋨魤餓遻蕚噁噩擜餩閼覨諤鍔騀鵈鳄鵝鵞顎額歞譌礘襨鶚鰐櫮鰪颚额齃讍欕鑩齶鱷"},
        new string[]{"Ei","欸誒"},
        new string[]{"En","奀峎恩蒽摁煾"},
        new string[]{"Eng","椧鞥"},
        new string[]{"Er","儿二尔尒尓弍弐而耳児刵佴侕陑迩峏饵洏洱荋乻贰咡耏珥胹毦栭栮铒鸸袻唲貮貳聏粫輀誀鉺餌鲕爾樲隭髵髶駬鴯鮞邇薾臑轜趰"},
        new string[]{"Fa","乏发伐冹姂法沷坺佱茷垡峜阀珐発疺罚砝栰笩筏酦琺發傠彂瞂罰閥髪髮罸墢蕟鍅橃藅灋"},
        new string[]{"Fan","凡凣凢反払氾犯忛汎仮帆奿匥返泛饭杋柉贩范钒矾籵舤畈舧袢軓訉烦梵釩販笲笵畨盕番軬飯飰棥煩滼勫緐範墦蕃嬎嬏幡噃憣樊橎燔旙薠璠膰繁襎輽繙翻藩旛轓颿蹯鐇礬瀪瀿蘩飜籓蠜鷭鱕"},
        new string[]{"Fang","匚方邡防仿访芳彷妨汸纺坊房枋牥放昉昘瓬肪钫眆蚄紡舫旊淓倣堏訪趽鈁鲂髣鴋魴鶭"},
        new string[]{"Fei","飞发妃吠芾废沸狒怫杮非肥肺朏胇胐昲费飛厞剕匪陫俷诽疿菲萉啡婓婔奜悱屝淝渄绯猆扉棐廃暃腓靟費斐痱裶蜚蜰緋翡镄榧廢蕜誹鲱霏曊篚癈餥鼣馡騑蟦濷騛鯡櫠鐨靅飝"},
        new string[]{"Fen","分份芬弅帉吩妢岎汾纷坟坋炃枌氛昐玢忿奋朌衯秎竕紛翂蚠蚡粉訜酚偾棻梤棼焚鈖粪愤雰馚蒶僨隫蕡濆獖幩墳魵憤瞓膹黺豮餴燌燓橨朆奮鲼鼢糞鼖豶轒鐼饙瀵馩黂鱝"},
        new string[]{"Feng","丰凤风冯凨仹讽凬妦沣沨夆枫奉凮封盽疯砜風覂逢俸峰峯浲唪偑桻琒烽焨堸堼锋葑猦崶渢湗溄馮鳯漨摓缝犎楓赗煈艂蜂綘碸瘋鳳鴌篈鋒僼鄷賵縫諷檒豐鎽鏠酆蘴寷灃蠭靊飌麷"},
        new string[]{"Fo","仏佛坲"},
        new string[]{"Fou","缶否妚缻缹紑雬殕鴀"},
        new string[]{"Fu","斧乀阝讣夫巿父弗付伕伏邞凫妇负甶甫孚妋呋扶抚芾芙芣附刜佛苻茀彿弣府拂拊驸岪泭绂绋坿咈咐帗姇怫枎玞肤服竎阜赴罘負訃砆韨怤畐畉衭胕玸炥氟祓祔枹柎柫复垘洑峊茯荂俘俛俌鳬郛郙俯莩荴浮娐哹栿尃袚袝砩蚨蚥釜釡趺麸翇符笰虙酜蚹艴紱紼紨袱旉琈脯烰桴辅婦婏涪捬菔冨偩匐副傅復葍萯富媍幅赋棴椨焤腑盙稃秿絥蛗詂罦覄跗鈇鉘鉜筟艀鲋颫鳧蜉蜅綍綒腹福椱辐滏缚鄜赙孵榑禣稪複褔韍箙腐粰豧輔賦頫髴鳺鴔駙麩緮蝠蝮蝜膚敷蕧澓撫幞嘸嬔縛麬諨﨓鮄鮒糐輹輻踾鍑鍢癁賻黻鳆鬴襆簠馥麱覆鵩黼懯襥鰒鶝斧"},
        new string[]{"Ga","玍轧尕旮钆乫凩夹伽尬呷咖尜釓躮魀銯嘎噶嘠錷軈"},
        new string[]{"Gai","丐乢匃匄忋芥改侅该陔郂荄姟峐钙垓晐赅祴盖畡絠絯鈣摡溉葢隑蓋戤概槩賅賌豥該漑槪鎹瓂"},
        new string[]{"Gan","干仠甘忓芉奸迀汵杆攼旰玕肝皯矸衦秆盰泔绀坩姏苷柑竿酐赶疳凎倝淦敢桿笴粓紺詌骭稈凲感尴尲筸幹鳱趕榦漧澉橄澸擀尶檊尷魐簳贑鳡赣贛鱤灨"},
        new string[]{"Gang","冈冮刚扛岗纲杠肛疘矼牨岡缸钢罡剛掆崗堈釭港棡焵焹犅堽摃筻槓罁綱鋼鎠戆戅戇"},
        new string[]{"Gao","夰告吿杲郜勂诰峼祮皋羔高髙皐祰菒稁锆臯筶搞缟槔槁槀睾暠禞膏誥鋯稿稾镐槹橰糕縞篙羙藁藳檺鎬餻韟櫜鷎鼛鷱"},
        new string[]{"Ge","个戈仡乬叾巪犵扢纥圪合各呄戓肐疙牫匌佮咯挌阁饹茖虼革鬲敋格胳哥哿唟個铬鸽硌袼舸盖愅蛤蛒臵裓割隔葛搁塥滆滒彁嗝嗰觡鉻閤閣箇膈槅戨歌搿镉獦鞈骼韐鴚輵諽謌擱鴿鮯韚鎘鎶櫊轕鞷騔"},
        new string[]{"Gei","给給"},
        new string[]{"Gen","亘亙艮茛哏根揯搄跟"},
        new string[]{"Geng","更刯庚郠畊耿耕莄哽峺挭浭绠埂菮梗椩堩赓焿絚綆暅鹒縆緪賡鲠骾颈鯁鶊羹"},
        new string[]{"Gong","工弓廾厷公功巩共红贡杛攻汞糼糿肱供侊拱宫宮唝蚣珙拲栱恭貢躬龚匑嗊幊愩塨躳輁觥熕慐碽匔鞏髸觵龏赣龔"},
        new string[]{"Gou","勾句沟佝芶苟诟狗岣坸购构枸玽钩耇耉垢姤冓痀袧够夠耈啂蚼笱訽豿鈎缑鉤雊詬媾搆溝遘彀煹觏構撀褠緱篝購覯簼鞲韝"},
        new string[]{"Gu","夃古诂估杚汩谷股沽泒固孤苦苽咕呱姑牯柧故轱骨鸪钴罛罟贾家唂唃凅逧傦菰菇啒崮崓堌淈牿梏蛄蛊笟脵祻鹄觚辜詁酤棝愲尳馉蓇雇軱軲鼓鼔榾鈷鈲痼稒毂锢鹘皷箍箛榖僱嘏嫴篐穀縎糓鲴顾羖鴣鮕錮薣橭濲餶皼臌嗀轂盬瞽瀔鯝鶻顧蠱"},
        new string[]{"Gua","叧冎瓜诖坬呱卦刮剐挂胍栝剮啩桰掛鸹罣絓颪歄煱詿趏褂緺寡劀踻颳鴰騧"},
        new string[]{"Guai","夬叏乖拐怪恠柺枴罫摑箉"},
        new string[]{"Guan","卝毌丱关观串纶官贯泴冠矜覌倌莞馆掼惯悺涫貫祼蒄琯棺悹痯筦窤管関遦摜潅慣瘝樌輨錧舘盥館璭雚罆闗観鳏躀癏關鏆灌爟瓘鰥鳤矔鹳礶罐觀鱞鑵鱹鸛欟"},
        new string[]{"Guang","广広光灮犷炗炚炛俇茪咣姯洸垙逛烡桄珖胱臦僙輄銧廣黆獷臩"},
        new string[]{"Gui","宄归氿圭轨攰妫龟庋匦邽陒佹诡刿刽昋炅炔规柜攱闺茥姽垝恑贵皈癸軌鬼帰庪胿祪珪桂桧匭亀規硅袿蛫筀貴廆猤媯湀椝椢晷瑰蓕觤詭郌跪閨鲑厬摫嫢瞆槶槻槼嬀撌劌劊螝龜樻瞡璝禬瞶檜簋鮭鬶雟襘蟡櫃癐歸嶲騩鳜鐀瓌櫷蘬鞼鬹鑎鱖鱥"},
        new string[]{"Gun","袞丨绲惃辊棍睔蓘滚滾蔉緄緷輥鲧磙鮌衮鯀謴"},
        new string[]{"Guo","过呙囯国囶囻果圀咶郭涡埚堝淉國惈菓帼過啯猓崞馃掴椁楇腘腂锅聒鈛瘑墎蝈蜾聝粿綶裹槨漍濄慖嘓彉幗蔮虢膕輠餜鍋簂蟈馘彍懖褁鐹"},
        new string[]{"Ha","乤扖呵哈虾紦铪溌奤鈨蛤楾鉿鞐襅噺鎺鰰鰚鱩"},
        new string[]{"Hai","亥还妎咍咳骇孩氦胲害海烸餀塰嗨嗐躵酼骸駭駴醢饚"},
        new string[]{"Han","兯厈邗汉汗犴扞闬屽旱含邯佄罕函凾虷垾圅悍唅哻莟捍猂娢浛浫涆涵菡崡焓焊晗晘琀蚶梒釬閈睅酣頇皔韩嵅寒喊傼感甝蛿筨馯谽蜬蜭爳蔊漢嫨撖澏銲鋎鋡憨暵熯顸魽頷馠憾螒翰撼韓顄鼾駻雗豃譀瀚颔鶾"},
        new string[]{"Hang","夯行苀迒吭沆斻炕杭肮绗巷垳桁珩航笐蚢貥裄筕絎頏魧颃"},
        new string[]{"Hao","乚号好昊昦秏郝侴茠竓蚝耗哠悎恏皋浩淏晧毫椃皓傐鄗蒿嗥獆滈聕號貉豪暤獔噑嘷獋暭澔皞皜镐皡曍嚆薅薃薧儫嚎濠皥壕籇蠔譹顥鰝灏灝颢毜"},
        new string[]{"He","禾纥合吓何诃佫郃劾呵和咊姀抲河贺狢峆饸阂垎柇曷盇籺紇袔盍盉敆欱核害哬荷釛龁菏萂啝寉焃涸渮盒鹄惒粭賀訸訶猲喝嗬嗃遤阖澕煂詥楁碋毼貉貈鉌鲄餄閡麧牙合鹖赫褐熇熆鹤頜魺螛翮翯篕謞癋壑嚇餲鞨闔齕颌燺爀礉覈蠚鶡鶴鶮鑉皬龢鸖靍靎靏"},
        new string[]{"Hei","黒黑嗨嘿潶"},
        new string[]{"Hen","佷很哏狠拫恨痕詪鞎"},
        new string[]{"Heng","行亨恒恆姮珩胻悙烆桁哼涥啈脝鸻撗横橫鴴衡蘅鑅"},
        new string[]{"Hong","仜讧弘叿妅屸红纮灴汯吽吰呍闳宏玒玜轰宖苰泓洪垬娂荭哄紅羾虹訇沗訌耾翃紘晎竑唝烘浤鸿硔紭軣谹閎粠鈜硡竤渹渱焢揈葓葒綋翝谼閧鉷潂魟鞃澒撔銾鋐谾篊霐闂輷薨蕻彋鬨黉鴻嚝鍧闀霟轟黌"},
        new string[]{"Hou","后吼犼郈侯茩後逅洉垕矦厚候鄇帿葔堠猴喉豞鲎鲘銗睺瘊糇翭骺篌鮜翵鍭餱齁鯸鱟"},
        new string[]{"Hu","互弖户戶戸乎冱匢芐虍戏芴帍乕囫沪沍汻护抇狐垀泘怙戽枑弧苸和呼岵虎昒昈忽曶胡怘轷祜瓳烀恗浒核壶俿匫粐笏隺虖斛瓠萀壷婟唿唬焀惚扈淴湖猢搰楛喖媩壺葫鹄琥虝絗軤雇雽綔瑚鄠嗀楜煳摢寣滹滬滸嘝嘑嫭嫮蔛蔰鹘鹕雐鳸魱蝴糊箶幠熩槲槴歑縠螜膴醐頶錿鍸餬鍙簄觳豰謼鹱鵠嚛瀫鬍鶘鶦鰗護鳠頀鸌鱯"},
        new string[]{"Hua","化华划夻呚花话杹枠画哗骅姡砉婲華桦崋埖椛婳釫釪铧硴畫猾滑搳撶畵嬅嘩糀觟話誮磆鲑劃樺摦澅槬螖蕐嫿鋘錵諙諣譁黊鏵舙繣譮驊蘤鷨"},
        new string[]{"Huai","划坏怀徊淮槐褢踝褱懐壊壞懷瀤櫰耲蘹蘾"},
        new string[]{"Huan","幻欢肒还奂犿郇环荁奐宦狟洹峘涣浣换唤桓烉眩患焕梙萑萈逭喛喚寏換渙嵈缓堚愌睆痪絙雈綄豢貆煥瑍獂漶瘓锾緩槵歓鴅鲩圜阛澴澣缳擐寰嬛還豲環鍰鵍鯇镮鹮藧酄攌糫繯轘懽獾孉嚾鯶鰀鐶闤歡鬟瓛讙貛驩"},
        new string[]{"Huang","巟肓怳恍炾荒皇晃晄宺隍凰偟谎奛朚黄黃喤崲揘湟葟徨遑媓塃堭慌惶愰楻煌滉幌瑝詤锽潢熀榥墴獚曂熿皝璜蝗艎篁穔縨謊諻癀磺蟥簧鍠餭鳇兤櫎韹鎤趪皩鐄騜鰉鱑鷬"},
        new string[]{"Hui","卉屶屷汇囘回戏灰灳讳会虫囬炜泋佪诙廻廽茴荟诲咴哕迴洄浍洃挥拻绘虺恢恛袆芔恚恵贿珲悔桧晖蚘豗烩烠烣逥彗堕婎晦秽痐辉惠蛔蛕翚翙絵媈揮湏缋隓廆阓喙彚彙匯煇滙賄蜖詼詯睢會暉禈毁毀楎褘睳瘣誨幑嘒僡蔧蕙噅噕寭潓撝圚翬輝麾慧槥憓暳毇璤橞頮諱嬒獩濊徻薈薉藱徽隳燬燴餯鮰篲檅檓璯懳穢瞺繢蟪瀈嚖翽譓繪颒櫘闠鏸譭蘳儶鐬靧顪鰴譿"},
        new string[]{"Hun","忶昏诨荤浑俒昬珲倱圂混涽阍婚婫馄掍惛殙焝棔葷渾溷琿睧魂睴睯觨慁尡蔒諢閽餛轋鼲"},
        new string[]{"Huo","灬火邩伙吙沎或和佸货钬咟活捇俰获秮眓閄秴秳貨剨掝喐祸禍惑旤湱耠鈥锪窢漷煷蒦夥劐奯嚄擭獲濩鍃霍雘豁謋檴镬穫矆蠖耯艧騞瀖攉嚯彟藿嚿曤臛鑊矐癨韄靃彠"},
        new string[]{"Ji","几亼亽及己彑讥计丮旡饥刉记击伋叽吉彶妀芨伎刏乩级纪圾忣犱岌汲机玑肌齐系矶忌鸡极泲坖技即际芰妓奇郆其剂佶亟枅季虮級紀笈急皍計革﨤既挤给垍济洎迹叝卽姞咭哜荠茤茍唧姬剞剤屐堲继揤觊記觙飢积脊疾畟笄紒谻祭鱾旣焏梞楖掎绩基悸寄寂済卙偈偮庴徛喞葪蔇湒嵇嵆缉棘極赍殛戢戟幾犄集惎朞臮筓裚継蝍稘痵畸趌跻跡鬾麂鳮魝辑楫愱塉嵴蒺蓟嗘嫉兾勣際僟漈漃槉暨禝魢魥毄跽銈銡鲚霁誋穊稩膌耤綨緁箕箿齑緝撃稽稷畿瘠鹡諅諆觭躸鲫踑踖暩槣樭潗濈嶯撠嘰蕺蕀薊隮劑冀墼激檝機橶曁禨錤髻襀穄積璣螏輯覬賷繋簊磯磼績擊穖襋羁罽鍓蹐檕濟擠藉薺嚌檵櫅蹟雞齌鯽鵋璾耭蟣艥穧癠鶏鯚鯲韲譏懻骥廭蘎蘮瀱譤饑霵鏶鐖鱀轚籍繼癪鶺鷄魕齎躋鞿霽鑇鷑鰶鰿羇蘻虀覉齏鑙躤鸄羈覊鱭驥雧"},
        new string[]{"Jia","加甲价夹夾扴抸圿忦伽佳茄郏迦拁泇岬驾浃叚郟荚毠枷架珈玾胛恝钾痂莢唊浹贾斚家假铗笳戛脥梜耞戞跏裌蛱傢葭徦婽猳斝幏嫁嗧蛺跲鉀鉫筴賈腵椵犌槚榎榢瘕嘏嘉價镓鋏駕頬頰糘鴐袈豭貑稼檟鴶鵊颊鎵麚"},
        new string[]{"Jian","见戋囝尖件幵奸间坚歼見戔饯拣浅冿建肩枧玪艰牮柬茧荐俭姦姧剑洊贱涧捡挸剣兼健俴倹栫珔笕监舰笺袸检梘减剪剱菅菺徤谏猏帴渐湕堅惤豜趼践跈詃間雃缄堿溅湔減揃揀寋葌楗検犍牋毽腱锏硷裥睑旔臶賎筧简絸睷碊键暕瑊瑐椷椾蒹谫弿搛缣煎鉴豣戬戩漸彅蔪僭槛榗監碱箋箭賤翦糋緘鹣樫儉劎蕑蕳劍澗熞墹踺踐諓鲣鳽趝餞鋻鍵諫熸撿薦劒劔縑篯艱瞷襇襉檢磵礀藆謇蹇鍳餰麉鞬馢鞯鵑鳒謭擶濺瀐礆檻瞼繭繝簡礛瀳殱譛覵覸鏩鵳鰎鬋鹸鰔鐧鐗瀽瀸蠒艦轞櫼殲鐱譼鰜鶼鹻韀鰹譾鑑鑒礷籛襺虃囏鑬鹼韉鑯鑳"},
        new string[]{"Jiang","匞匠讲弜江夅降茳奖将洚绛姜桨浆畕豇將弶强傋蒋葁塂絳畺酱奨奬蔣勥摪滰翞漿獎螀摾嵹槳僵薑壃缰犟耩膙糡螿醤講鳉殭橿醬糨礓疅疆繮謽顜櫤鱂韁"},
        new string[]{"Jiao","叫艽交呌臫角郊侥佼茭茮骄娇姣狡峧峤觉饺挢挍浇绞訆笅胶珓捁校轿较烄晈教敎皎脚铰矫窌窖蛟筊絞焦椒搅湫滘敫煍勦剿賋較腳跤踋鉸餃鲛虠酵僬僥嘄嘂嘦暞斠漖摷撟撹澆潐憍噍儌劋嶠嶕嶣徺嬌蕉膠膲嬓徼獥噭憿缴敽敿曒鮫鵁璬矯鹪礁穚轇簥蟜蟭皦藠醮譑轎繳趭鐎譥孂嚼皭驕鷦鷮鱎灚攪釂龣"},
        new string[]{"Jie","卩卪孑尐丯介节讦价阶刧劫芥刦吤庎戒杢岊岕昅疖毑玠疌衱届屆杰姐诘劼刼诫迼狤结拮洁衸皆砎疥界畍訐蚧悈桔桀桝家莭倢借偈偼菨階婕媎徣唶崨接捷掶掲袺痎秸脻絜結蛣揭湝椄堦堺嗟喈喼媘媫嫅傑煯楷楬楐楶滐嵥搩蜐蛶節琾睫詰解觧飷鉣骱鲒鞂誡碣犗稭竭榤截蓵擑潔镼褯蝔誱鞊頡魪踕幯藉嶻擮檞鮚鎅鍻礍癤謯颉街巀蠞蠘鶛羯蠽"},
        new string[]{"Jin","巾今仐仅斤钅伒劤尽妗进近劲侭兓枃卺金釒觔砛衿津浕矜巹勁荩荕矝珒晋晉浸烬赆紧紟堇祲惍琎菫進唫琻堻煡筋釿禁靳搢缙溍锦寖谨厪僅蓳嫤馑廑盡瑨漌墐緊黅鹶殣瑾璡觐槿歏凚僸儘噤濅縉錦賮濜壗嚍嬧藎燼璶謹襟覲饉贐齽"},
        new string[]{"Jing","井丼阱劲刭巠宑妌汫坓坕坙泾迳弪净茎京径汬肼经穽秔胫亰荆荊剄俓婙浄涇弳逕倞凈莖徑竞痉竟竫惊脛殌旌旍桱梷菁婧婛猄淨経靓葏敬晶景腈稉竧痙睛粳傹靖經綡誩静踁頚聙儆兢境獍精憬璄幜澋靚靜鲸頸璟璥憼暻曔橸镜瀞蟼鵛鶄鶁鯨鏡警麖競鼱驚竸麠"},
        new string[]{"Jiong","冂冋冏囧炅迥泂逈侰炯扃坰埛浻烱絅窘煚綗煛僒熲駉駫澃褧顈燛颎蘏蘔"},
        new string[]{"Jiu","丩九久乆乣勼匛氿纠旧牞臼朻汣奺杦灸究糺玖鸠糾疚舏咎柩柾赳韭紤镹酒桕阄倃萛匓厩救韮廄廐就啾湫揪揂鳩揫舅摎廏僦樛慦殧鹫舊鯦鬏蹴麔匶欍齨鷲鬮"},
        new string[]{"Ju","巨车凥句且讵苣邭姖岠怇局拒抅洰泃沮泦拘拠居狙炬岨咀驹弆具匊苴柜昛歫秬钜狊矩枸莒侷举陱剧俱倨倶捄挶桔挙毩罝蚷眗疽砠袓耟粔詎距蛆梮掬据涺淗焗惧埧埾菊郹啹崌娵婅婮飓湨椐椈椇毱犋琚腒锔跔跙趄鉅筥輂豦裾虡龃锯犑榉榘蒟雎駏閰寠愳蜛聚窭跼粷艍諊躹踞踘趜鋦聥勮劇屦駒鮔鮈鴡壉遽懅澽據窶橘鋸踽舉檋擧屨駶颶鞠鞫鵙﨔繘貗蹫簴鵴鶋鶪鼰齟醵躆櫸蘜巈懼欅鐻籧鼳驧"},
        new string[]{"Juan","奆劵呟卷姢巻帣捐涓绢埍娟狷勌倦悁桊隽鄄瓹朘焆眷菤圈淃捲睊鹃罥裐腃絭絹睠锩镌慻蔨勬餋踡鋑錈獧臇羂鎸鐫讂蠲"},
        new string[]{"Jue","亅孓孒决刔诀氒角芵弡決抉泬玦玨珏觉绝砄虳疦挗捔倔蚗欮桷斍脚觖覐訣掘崛崫趹赽趉鈌焳傕厥覚絶絕阙劂谲瑴駃鴃鴂憰爴瘚觮蕨蕝噘噊獗熦嶡嶥撅撧噱憠橛橜镢臄爵櫭蟩蟨屩屫爑譎蹶蹻蹷鐍鐝矍鳜覺嚼匷爝灍觼戄玃攫彏鷢矡貜躩钁"},
        new string[]{"Jun","军龟君呁汮均钧袀姰郡陖俊軍隽骏峻馂捃浚莙蚐埈焌桾晙珺皲菌葰竣畯棞雋鈞筠碅蜠皸皹儁箘箟賐銁覠銞餕鲪寯懏燇麇頵駿鍕濬麏鵔鵕鵘鮶麕攈攟"},
        new string[]{"Ka","卡凧佧咖咔咯垰胩桛裃閊喀楿綛鉲銯聢錺鎹嬶鵥鯑鶍鰚蘰"},
        new string[]{"Kai","开忾剀凯炌闿恺奒垲烗欬铠勓蒈剴凱嘅揩慨锎開楷輆愷愾塏嵦暟锴躾鍇鎧鎎闓鵥颽鐦"},
        new string[]{"Kan","凵冚刊坎侃看砍衎莰崁栞惂偘勘龛嵁堪欿歁戡墈槛阚輡磡瞰顑闞轗竷鬫龕矙"},
        new string[]{"Kang","亢匟邟伉扛抗囥忼闶犺炕钪砊粇康鈧閌嵻嫝慷漮槺穅糠躿鏮鱇"},
        new string[]{"Kao","丂尻考攷拷洘烤栲铐嵪銬鲓犒熇廤髛靠鮳鯌"},
        new string[]{"Ke","厼可克壳岢坷迲呵苛刻匼勀勊咳客轲炣柯峇恪牱牁珂科钶疴砢趷娔课渇堁骒硛蚵氪殻殼敤愘痾翗軻缂棵渴揢嵑嵙萪嗑搕溘兡鈳锞稞愙犐窠碦榼薖樖嶱磕艐蝌緙躻課瞌頦穒錁髁醘顆騍鯑衉颏礊礚鯳颗"},
        new string[]{"Ken","肎肯肻垦恳啃掯硍裉褃豤貇錹墾懇"},
        new string[]{"Keng","阬劥吭妔坑挳硁牼铿硜硻誙摼銵鍞鏗"},
        new string[]{"Kong","孔空倥恐崆控涳埪悾硿箜錓鞚鵼"},
        new string[]{"Kou","口叩扣抠芤怐劶敂眍宼冦釦寇窛筘剾蔻蔲彄摳滱瞉瞘簆鷇"},
        new string[]{"Ku","库刳郀苦狜矻绔枯俈庫哭桍秙堀萙袴焅裤絝跍蒅喾圐楛瘔窟骷酷褲鮬濹鶎嚳"},
        new string[]{"Kua","夸侉咵姱挎垮胯趶舿誇跨銙骻"},
        new string[]{"Kuai","巜凷圦会块快侩郐哙狯浍脍欳塊筷蒯鲙墤鄶儈廥獪擓噲澮膾糩旝鱠"},
        new string[]{"Kuan","宽款髋完寛寬梡棵欵歀窽窾鑧顆颗髖"},
        new string[]{"Kuang","邝匡夼纩圹抂狂狅忹旷况矿岲況邼劻诓诳匩洭哐昿恇贶砿框眖眶硄絋軖軠軦絖筐貺鉱筺軭誆誑鋛鄺儣壙懭黋鵟爌曠懬穬礦矌纊鑛"},
        new string[]{"Kui","亏归刲岿尯奎悝晆盔馗逵匮隗鄈傀葵蒉喹喟愦愧骙媿馈揆溃頍魁跬暌戣煃楏楑窥睽磈匱嘳蕢潰嬇憒篑蝰聩聧聭窺膭謉頯殨藈虧鍨鍷餽櫆簣聵蹞顝騤闚饋籄蘷夔巋巙虁犪躨"},
        new string[]{"Kun","困昆坤捆涃阃悃晜祵猑崑崐壸堃堒菎梱裈裍稇睏髠琨焜硱壼髡鹍綑稛锟裩褌蜫髨潉熴瑻醌閫閸鲲錕騉鵾鯤鶤"},
        new string[]{"Kuo","扩拡括挄栝蛞筈萿葀阔廓頢髺韕鞟闊擴濶霩鞹鬠"},
        new string[]{"La","凩旯垃拉剌柆砬啦菈翋落揦喇溂腊揧楋楿搚瘌蜡蝋躵辣辢蝲磖臈簓鞡鮱癞藞邋攋臘爉鬎鯻鰚瓎镴櫴嚹蠟鑞"},
        new string[]{"Lai","来來俫倈莱徕涞崃郲崍赉淶徠逨庲唻婡猍萊萙梾躮筙棶琜铼睐睞赖箂賫賚賴錸頼濑顂騋癞鵣鶆鯠麳籁瀨瀬藾癩襰籟"},
        new string[]{"Lan","兰岚拦烂览栏浨惏婪嵐葻揽缆阑榄滥蓝谰漤罱褴澜醂懒儖斓篮覧壈燗燷燣镧襕藍嚂懢濫闌爁擥璼襤譋懶嬾幱蘭蘫孄攔瀾灆籃繿覽斕瓓欄爛襴籣灡孏囒灠攬讕爤欗躝鑭顲欖爦襽糷纜钄韊"},
        new string[]{"Lang","勆郎郞莨狼崀浪埌阆欴朗朖琅嫏烺桹蓈廊啷斏郎榔瑯稂锒硠蜋郒艆筤塱蒗蓢樃躴誏螂鋃閬鎯朤"},
        new string[]{"Lao","耂老牢劳労佬咾荖姥狫络恅窂烙捞涝浶珯栳崂唠哰硓铑铹痨粩閖勞落嗠耢酪銠僗嫪嶗獠嘮潦澇撈憦躼橯憥朥癆磱蟧醪耮簩轑軂鐒顟髝"},
        new string[]{"Le","了阞仂艻叻乐扐氻忇朰玏肋泐竻浌饹砳勒楽榁嘞餎韷樂簕鳓鰳鱳"},
        new string[]{"Lei","厽肋耒泪诔洡垒类涙淚勒累絫塁傫誄雷酹銇嘞嫘蔂漯缧樏蕌頛頪磊畾磥錑蕾擂儡檑縲礌癗镭壘攂藟矋櫐櫑瓃類礧礨蠝罍纇纍鐳羸灅蘲蘽蘱轠讄靁鑘儽壨禷虆颣欙鑸鸓纝鼺"},
        new string[]{"leng","冷倰唥堎塄愣棱楞稜睖碐踜薐"},
        new string[]{"Li","力历厉屴礼立朸吏刕丽利叓苈呖励沥李坜里礼隶枥疠戾沴岦苙例俚俪俐郦厘荔茘峛峢疬栎栃轹赲砅砺砾鬲离悧栗栛秝珕峲狸猁涖浰哩唎逦骊娌娳莉莅荲剓菞婯唳理琍悡脷梨梸悷犁蛎蚸粝粒笠蛠鹂裡雳跞詈犂棃棙痢锂喱凓厤傈厯剺蓠蒞蒚漓溧甅睝睙缡塛慄搮鉝魞蜊筣豊粴艃鳨裏聢綟蜧貍孷樆竰盠歴暦璃瑮嫠厲蔾犛鲡鲤鋰錺鋫蝷褵糎黎鴗縭篱篥罹錅隷曆歷澧勵巁濿禮癘檪隸謧醨磿蟍鵆鬁蠇釐離鯉鯏鯐櫔犡擽禲曞爄邌嚟藜儮藶嚦瀝瓅瓈攊斄壢櫟鯬鏫蟸礪麗鵹黧裏礫蠣糲醴櫪瓑爏皪盭癧灕囄蘺儷酈鳢蠡蠫礰麜鷅觻轢躒囇邐廲孋攦欐劙讈鑗轣籬靂鱧攭穲瓥欚鱱纚靋驪鱺鸝"},
        new string[]{"Lia","俩"},
        new string[]{"Lian","连奁帘练怜炼恋涟連莲殓脸敛琏梿链裢裣联堜媡湅萰僆亷蓮嗹廉漣溓慩摙楝煉瑓璉熑槤潋奩蔹匲覝鲢匳劆噒憐嫾磏褳聨聫練縺螊聮嬚濂澰濓薕翴錬鍊謰蹥鄻殮聯櫣燫斂歛臁臉襝镰鏈鎌簾蠊瀮瀲蘞蘝鬑鰊鰱鐮籢籨戀纞"},
        new string[]{"Liang","両两良兩俩俍亮谅莨唡哴倞倆凉悢辆梁啢掚涼湸喨椋辌晾脼量靓凉輌粮粱裲蜽墚緉踉樑輛輬諒鍄魉魎駺糧"},
        new string[]{"Liao","了辽尥尦钌疗炓料釕聊尞鄝僚蓼廖寥嵺憀撂漻膋潦缭撩憭嘹敹嶚嶛寮嫽獠遼暸橑燎膫璙窷竂療鹩镣瞭蟟豂蹘繚簝賿廫藔屪爎镽蹽鐐飂髎爒飉鷯"},
        new string[]{"Lie","列劣劽冽洌茢迾咧姴挒挘哷浖埒埓烈烮栵捩猎猟蛚聗趔煭颲巤儠鴷鮤裂獵擸犣躐鬛鬣鱲"},
        new string[]{"Lin","厸邻阾吝拎林恡临冧悋赁啉崊淋菻焛晽琳粦賃碄亃鄰隣蔺僯箖粼遴凛凜潾嶙獜撛辚懔懍澟廪廩閵霖璘膦font>暽甐燐斴橉隣檩檁瞵磷疄臨癛癝繗翷麐蹸轔藺瀶壣鏻鳞躏驎躙麟鱗躪轥"},
        new string[]{"Ling","令另刢伶灵狑岭岺彾泠苓呤姈坽囹夌昤朎瓴玲炩柃陵羐凌皊秢铃竛鸰砱袊蛉聆紷琌衑翎舲笭婈菱棂淩掕崚绫棱軨詅跉祾裬龄鈴零蓤閝領蔆綾霊輘駖鹷鲮鴒魿霗錂蕶澪嶺燯霛霝齢领羚鯪酃孁蘦齡櫺靈醽欞爧麢龗"},
        new string[]{"Liu","六刘陆畄浏斿柳栁桞珋流留翏琉绺桺旈锍畱裗硫碌塯旒溜骝媹嵧馏蒥蓅遛廇飗熘榴瑠綹罶瑬磂瘤鹠駠鋶镏熮劉澑橊橮镠璢鹨磟疁蟉癅駵蹓鎏麍鎦餾霤懰瀏嬼羀嚠藰雡飀鏐鐂飂騮鬸鰡鶹飅鷚驑"},
        new string[]{"Long","龙陇弄咙茏泷垄垅拢昽珑胧栊哢眬竜砻笼聋隆梇湰滝漋嶐槞龍癃窿篢篭鏧霳隴儱嚨巃巄蘢徿瀧壟壠爖櫳朧瓏曨攏襱竉礱礲矓龒龓聾豅躘蠪蠬籠贚靇鑨驡鸗"},
        new string[]{"Lou","陋娄婁偻屚搂喽溇蒌嵝楼镂瘘嶁蔞遱廔漏漊塿慺嘍摟熡蝼樓甊篓耧瞜瘺瘻螻耬艛簍軁謱髅鏤鞻髏露鷜"},
        new string[]{"Lu","六卢圥甪卤陆芦庐侓录彔泸垆坴枦炉虏胪栌轳峍辂焒陸勎舮鸬赂玈舻硉閊鹵鹿菉渌淕淥掳娽逯绿禄祿琭椂鲁鈩硵碌盝睩稑虜賂輅鲈路僇勠剹蓼蔍蓾廘漉滷摝塶塷馿箓粶膔踛醁趢辘戮撸樚樐熝澛噜魯魲潞蕗橹擄録錄錴氇穋盧磠穞镥螰簏鴼璐謢颅擼瀂嚕騄蹗簶轆鹭艣氌簬簵鏕鏀麓鵦鵱嚧廬瀘蘆攎獹壚璷櫓鯥櫨曥瓐爐臚矑艪騼露鏴鐪籙籚艫纑蠦罏轤鑥鑪鷺虂髗顱鸕鱸黸"},
        new string[]{"Lv","吕呂驴侣郘侶闾挔捛垏律祣梠旅捋虑稆铝率绿偻葎嵂屡缕氯絽滤榈僂屢綠緑褛膂鋁閭膢膟箻履慮氀膐褸縷繂儢勴藘櫚濾爈櫖穭鑢驢"},
        new string[]{"Luan","乱卵娈峦孪栾挛釠脟鸾脔滦亂銮鵉奱巒孌圝孿欒曫攣灓羉臠圞灤虊鑾癴癵鸞"},
        new string[]{"Lue","寽畧稤鋝鋢掠略锊圙"},
        new string[]{"Lun","仑伦论芲抡沦纶囵轮侖倫陯圇惀菕埨淪掄婨崘崙棆腀稐碖溣嗧蜦耣綸輪論踚錀磮鯩"},
        new string[]{"Luo","剆泺罗洛峈络荦咯骆倮烙洜珞捋脶逻萝猡啰硌硦絡笿跞落腡椤蓏詻裸锣犖雒箩骡摞漯躶頱駱镙瘰螺鵅鮥鮱濼覶鏍蠃羅蠡覼騾臝儸邏蘿玀囉攞欏驘曪鸁籮纙癳鑼饠囖"},
        new string[]{"Lv","绿率铝驴旅屡滤吕律氯缕侣虑履偻膂榈闾捋褛稆侶儢勴卛卢呂哷垏壘娄婁寠寽屢嵂庐廬慮慺曥梠樓櫖櫚櫨氀焒爈瘻盧瞜祣穞穭箻篓簍累絽綠緑縷繂膐膢葎蒌蔞藘褸謱軁郘鋁録鏤鑢镂閭馿驢魯鲁鷜鹿"},
        new string[]{"M","呒呣姆"},
        new string[]{"Ma","亇马吗妈犸孖杩祃玛抹码閁蚂骂唛唜馬麻傌嗎獁媽溤睰痲痳瑪禡嫲榪嘛嘜蔴犘摩碼罵魸駡蟆蟇螞鮲鎷鬕鰢鷌"},
        new string[]{"Mai","劢迈买売佅麦卖荬脉脈埋麥買勱邁嘪蕒賣霡薶霢霾鷶"},
        new string[]{"Man","娨屘悗埋曼蛮満满鄤僈谩蔓蔄幔馒摱嫚獌漫滿慢慲墁缦瞒熳樠槾澷瞞襔镘螨鞔蟎縵謾鏝鏋饅鳗顢鬘鬗鰻颟矕蠻"},
        new string[]{"Mang","邙芒吂汒忙尨杧杗牤氓盲盳笀恾厖茫莽哤娏狵庬浝牻莾铓硭釯痝硥茻蛖壾漭鋩蟒蠎駹蘉"},
        new string[]{"Mao","冇冃毛卯夘矛皃芼茆茅茂冐峁泖毟戼枆牦昴柕贸冒眊铆罞旄耄猫渵軞覒酕笷貿堥鄚帽媢萺蓩毷楙暓瑁愗鉚锚瞀鉾貌髦鄮氂髳貓蝥蝐錨蟊袤懋鶜"},
        new string[]{"Me","乄么匁扖庅嚒嚜嚰"},
        new string[]{"Mei","毎每没沒坆沬枚玫苺妹抺美凂昧祙栂眉袂眛脄浼莓挴郿谜梅脢珻痗寐睂跊鬽湄渼湈堳葿猸嵋嵄媒媚媄媺煤煝楣楳禖腜瑂鹛镅镁睸魅韎酶槑塺嬍霉鋂篃蝞羙燘徾鎂鎇糜黣鶥攗黴"},
        new string[]{"Men","门们扪闷汶玧钔門閅們菛捫焖悶椚暪璊燜鍆穈懑懣亹虋"},
        new string[]{"Meng","尨孟氓黾甿虻勐冡莔萌猛掹梦溕锰盟夢蒙鄳夣甍蜢艋蝱瞢橗鄸儚蕄幪懞懜擝獴濛錳氋檬曚朦鹲礞矇懵霥鯍鯭艨蠓矒饛霿靀顭鼆鸏"},
        new string[]{"Mi","冖米糸芈汨沕泌沵宓羋鼡弥侎怽觅峚迷祢祕弭咪洣宻袮粎敉脒秘眯梻裃覔覓密猕淧谜谧葞蒾幂渳椧塓覛詸幎蓂蔝蔤滵漞嘧蜜熐榓瞇銤鼏樒冪幦濗謎醚麋麊麿謐縻糜擟濔彌藌櫁羃禰簚靡麛蘪瀰嚸獼镾瓕攠戂孊灖蘼爢欕醾醿鸍釄"},
        new string[]{"Mian","宀丏汅芇免沔杣靣面眄勉俛娩眠绵婂渑偭勔冕葂喕湎媔缅愐睌棉腼綿緬臱蝒糆緜澠麪麫靦麺嬵檰鮸櫋矈矊矏麵"},
        new string[]{"Miao","劰妙庙苗杪玅秒竗眇描庿媌喵淼渺缈瞄鹋缪嫹緢緲篎廟藐邈鶓"},
        new string[]{"Mie","乜灭吀咩旀孭烕哶搣滅蔑薎鴓幭瀎懱篾櫗礣蠛鑖鱴衊"},
        new string[]{"Min","民皿忟冺刡闵苠黾姄岷抿泯垊怋旻旼忞玟珉盿敃闽勄砇罠悯敏捪崏笢笽閔黽缗湣惽琘琝瑉痻愍暋敯鈱碈緍閩僶潣憫慜緡錉鴖鍲簢鳘蠠鰵"},
        new string[]{"Ming","名命佲明鸣眀洺茗姳冥掵眳朙铭凕鄍蓂嫇猽溟慏詺酩銘鳴榠暝瞑螟覭"},
        new string[]{"Miu","谬缪謬"},
        new string[]{"Mo","丆万无匁末乮没圽沫殁歾歿妺抹陌茉帓帞冒枺尛昩脉皌秣眜眿袜砞莫莈裃絈酛眽貃蛨蒅谟蓦嗼摸獏馍嫫漠塻寞貊膜摹模銆靺麽麼魩魹黙摩镆瞐瞙瘼墨嫼嘿橅糢磨默貘謨謩懡嬷嬤擵嚤藦蟔鏌饃蘑爅癦髍魔驀礳纆劘耱囕饝"},
        new string[]{"Mou","牟劺侔哞恈某谋眸蛑缪踎謀鍪麰鴾繆"},
        new string[]{"Mu","木仫厼母目牟牡亩狇沐坶姆苜牧拇炑畂畆畒牳胟姥峔莫莯毪毣畝畞钼蚞砪雮畮焾募楘榁幕幙墓慔睦鉧鉬踇慕模氁暮暯霂艒縸穆鞪"},
        new string[]{"Na","内那凪呐吶妠纳乸郍肭钠衲哪拏娜南拿袦納笝軜豽雫捺貀鈉靹蒳嗱搻魶魸镎噺鎿"},
        new string[]{"Nai","乃艿奶氖疓佴廼奈哪迺耐柰釢倷萘腉渿鼐褦螚錼孻嬭"},
        new string[]{"Nan","囝囡男枏抩侽南柟畘莮娚难赧婻揇湳萳遖喃煵楠暔腩蝻諵難戁"},
        new string[]{"Nang","乪擃嚢曩囊蠰儾囔馕攮灢欜饢齉"},
        new string[]{"Nao","呶闹怓恼垴挠峱悩脑孬脳铙硇匘淖堖惱猱蛲詉閙瑙碙腦嫐碯鬧撓嶩憹獶蟯臑譊夒鐃獿巎"},
        new string[]{"Ne","丆匁疒那讷呐抐鼡呢哪眲訥焾縇"},
        new string[]{"Nei","内內那氝氞哪娞馁脮腇餒錗鮾鯘"},
        new string[]{"Nen","恁嫩嫰"},
        new string[]{"Neng","能"},
        new string[]{"Ni","尼屰氼你伲伱拟抳狔泥坭怩兒苨呢妮妳哛逆昵柅胒籾秜铌眤屔匿郳倪婗猊掜旎堄埿淣蚭棿晲惄跜鈮鳰腻楾睨溺愵孴嫟蜺聣暱馜縌輗觬誽貎膩鲵霓儗儞隬嬺薿擬嶷檷麑鯢聻齯臡"},
        new string[]{"Nian","卄廿年拈念秊哖姩秥涊淰埝惗唸捻粘辇鲇秊艌辗蔫撵撚碾輦鲶鮎黏蹍簐攆蹨鯰躎"},
        new string[]{"Niang","娘酿嬢孃醸釀"},
        new string[]{"Niao","裊鸟尿茑脲鳥嫋溺蔦樢袅褭嬝嬲"},
        new string[]{"Nie","乜帇圼苶陧枿痆聂臬涅捏捻隉菍啮揑湼敜嵲嗫踂踗踙噛摰镊镍槷臲篞嶭錜蹑鎳闑嚙聶孽孼蘖籋櫱囁齧颞鑈巕蠥糱糵囓讘躡鑷顳钀"},
        new string[]{"Nin","囜拰脌您"},
        new string[]{"Ning","宁佞侫苧咛狞拧泞柠倿聍甯寍寕寗寜寧澝凝橣儜嚀薴嬣擰獰濘檸矃聹鑏鬡鸋"},
        new string[]{"Niu","牛牜妞狃扭汼纽忸炄杻拗钮紐莥鈕靵"},
        new string[]{"Nong","农弄侬哝挊浓挵脓秾農辳儂蕽噥濃燶檂膿禯穠癑襛繷譨醲欁鬞齈"},
        new string[]{"Nou","槈耨獳鯑鎒檽鐞羺"},
        new string[]{"Nu","奴努伮弩呶驽孥怒砮莻胬笯傉搙駑"},
        new string[]{"Nuan","奻渜煗暖餪"},
        new string[]{"Nue","疟虐"},
        new string[]{"Nuo","那娜挪诺梛逽喏掿傩愞锘搦榒稬諾蹃鍩橠糑懧懦糥穤糯儺"},
        new string[]{"Nv","女沑钕籹恧朒釹衂衄"},
        new string[]{"nun","黁"},
        new string[]{"O","丆仒乯迲浌哦硛猠筽鳰旕噢縇穒纐"},
        new string[]{"Ou","区讴呕吘怄沤欧殴瓯鸥偶腢嘔漚塸慪熰歐蕅膒鴎耦縅甌毆謳藕藲櫙鏂鷗"},
        new string[]{"Pa","扒汃叭妑帊帕苩怕杷爬皅趴巼派袙耙舥啪掱琶葩筢潖"},
        new string[]{"Pai","沠迫拍哌派俳猅排渒徘湃棑牌蒎箄輫鎃闏簰簲"},
        new string[]{"Pan","丬爿扳冸判伴沜泮坢炍拌拚胖牉盼眅柈洀叛畔袢般盘萠番詊跘蒰幋媻溿槃搫頖鋬盤磐潘縏蹒磻瀊蹣蟠鎜鞶攀襻鑻"},
        new string[]{"Pang","雱乓仿彷厐庞炐肨胖逄旁胮眫舽嗙嫎滂徬膀膖磅螃耪覫鳑髈龎龐鰟霶雱"},
        new string[]{"Pao","刨抛拋泡垉狍奅庖咆炰炮爮疱皰砲袍脬匏萢喸軳跑鞄靤麃褜麅麭袌礟礮"},
        new string[]{"Pei","伂阫犻沛怌帔呸佩肧胚俖姵斾旆浿陪配珮培毰赔辔蓜锫裴裵馷賠霈醅錇衃轡"},
        new string[]{"Pen","呠瓫盆喯喷湓葐濆噴歕翸"},
        new string[]{"Peng","芃匉抨泙怦朋恲竼砰捀倗莑捧掽淎烹弸堋皏梈硑袶軯彭棚椪椖稝鹏塜塳搒蓬傰剻閛硼碰漰熢槰樥憉嘭澎輣輧踫駍錋韸篷篣磞膨髼鬅蟛蟚纄韼鵬蘕鬔騯鑝"},
        new string[]{"Pi","匹丕庀皮阰仳伓圮屁批伾陂邳吡否芘苉纰枇枈肶炋迲披抷狉狓岯坯毗毘砒铍疲被蚍悂秛秠郫陴紕翍旇耚豼啤埤淠崥脴蚾蚽痞脾腗焷琵椑揊豾鈚釽鈹鉟辟鲏媲嫓睥裨罴蜱稫膍潎銔銢諀髬駓鴄魮嶏劈隦僻磇噼擗澼壀魾鮍錃錍貔篺鵧噽螷甓憵礔礕癖鎞羆嚭疈譬闢鼙霹蠯鸊鷿"},
        new string[]{"Pian","片囨扁骈便胼偏谝覑貵腁骗媥缏楄楩犏賆跰褊翩篇骿駢蹁諞騈騙騗鶣"},
        new string[]{"Piao","朴莩殍票剽勡僄徱嘌骠嫖彯漂缥慓飘瓢瞟螵縹翲篻薸旚醥闝犥皫飄飃魒顠驃鰾"},
        new string[]{"Pie","丿氕苤覕嫳撇暼撆瞥鐅"},
        new string[]{"Pin","朩牝汖玭拚贫砏拼品姘娉娦貧琕榀嫔聘嬪薲蘋嚬穦矉礗频馪顰驞颦"},
        new string[]{"Ping","冯平乒评甹岼坪苹郱凭呯俜帡荓枰屏洴玶胓砯瓶涄娉帲萍淜屛蚲蛢聠缾艵塀焩蓱幈甁評鲆軿竮凴箳慿頩鮃憑簈檘"},
        new string[]{"Po","叵朴钋陂廹迫尀乶岥岶泊泼坡敀昢珀洦哛烞钷破砶釙粕笸桲婆湐酦蒪鉕魄頗蔢鄱嘙箥潑駊颇醗繁皤櫇醱嚩鏺"},
        new string[]{"Pou","抔抙咅哣娝捊垺剖掊婄犃箁裒"},
        new string[]{"Pu","仆攵攴圤扑朴抪炇巬哛匍陠莆圃埔浦烳菩脯铺痡葡菐普堡溥圑蒱蒲僕谱暜酺鋪舖舗諩暴潽墣噗獛撲擈氆璞樸檏穙镤镨瞨濮瀑鯆蹼贌譜曝纀鏷鐠"},
        new string[]{"Qi","七丌乞亓气邔讫芑企迄迉岂屺汔気祁齐盀玘杞矵沏汽圻忯岐岓弃启呇芪芞其呮奇亟妻泣斉肵歧祈祇亝炁盵疧柒砌契俟咠荠凄剘郪陭唘倛脐斊蚑蚔蚚栖桤栔氣欫旂耆竒起豈訖軝釮跂戚桼畦啐啓啟唭啔萋萁萕淇淒悽埼绮娸婍猉帺崎骐骑捿掑嵜缉愒湆湇葺攲蛴期棋棨棄棊棲欺欹晵敧琪琦夡祺紪鬿頎碕碁锜褀褄傶滊愭慽墄漆摖僛嘁蜞蜝碶旗甈暣榿綺綥緀粸綦綮齊踦槭璂禥慼憇襅稽噐蕲器螧憩碛磜磧磩鲯錡諬颀霋鵆魌蹊藄藒鄿濝懠臍檱櫀簯簱鳍騏騎闙鏚罊鵸鶀鶈鯕鯱麒蟿蘄蠐艩籏鐑鬐騹鰭玂麡"},
        new string[]{"Qia","卡圶拤冾帢峠恰胢洽硈袷殎掐葜酠跒擖髂"},
        new string[]{"Qian","千欠刋仟阡迁奷芊仱伣扦汘圱圲纤忴岍岒汧扲芡茾佥杄欦肷钎竏臤拑浅拪荨茜俔前乹粁钤牵铅钱钳歬蚈虔谸倩悭悓乾孯堑掮揵淺偂婜釺軡牽犍掔椠棈靬鈆鈐媊葥傔亁谦嵌嗛骞慊蒨僉遣鉗鉛签愆皘鹐蜸綪槏榩搴膁歉箝銭蔳慳墘塹撁潜潛蕁遷谴厱儙篏諐槧橬篟錢輤黔褰缱壍嬱黚顅鎆謙縴檶騝騚鵮簽鏲櫏繾濳攐攑攓譴騫鰬羬籖灊鬜鬝籤韆"},
        new string[]{"Qiang","羻羌呛抢戗戕炝斨枪玱羗将猐唴啌強跄腔强嗴獇椌溬搶嗆锖蜣锵嫱摤嶈蔷墙墏熗戧槍瑲牄樯漒蔃薔彊廧嬙墻篬謒羟蹌镪襁繈檣牆繦蹡鎗鏘艢鏹蘠"},
        new string[]{"Qiao","巧乔壳侨俏陗诮荞荍峤峭悄帩桥窍硗硚釥菬郻雀喬愀翘跷鄡鄥勪僑谯劁踍誚槗敲毃锹髚鞒骹頝蕉蕎僺憔墝墧嘺嫶撬撽缲幧墽燋燆橇樵橋犞韒鞘鍫鍬瞧癄磽礄竅繑翹鞩髜譙趫趬蹺繰櫵藮躈鐈鐰鞽顦"},
        new string[]{"Qie","切且癿伽茄妾厒怯匧砌窃悏挈洯惬淁笡蛪趄愜慊朅箧锲篋踥鍥穕鯜聺竊"},
        new string[]{"Qin","芹芩庈吣吢抋沁坅昑肣钦矜侵亲菦唚骎埐秦珡蚙耹笉赾梫捦菳菣寑揿嵚禽琹锓琴媇鈙鈫雂欽覃綅靲嫀勤溱嵰搇寝嗪寢廑慬誛鳹擒撳嶔嶜噙斳鋟螓瘽檎懄澿親衾懃螼顉駸蠄鮼鵭瀙寴藽"},
        new string[]{"Qing","庆夝苘靑青甠亲轻氢请凊剠郬卿勍倩倾啨寈掅氫殑情埥圊庼清淸硘殸頃軽棾氰晴葝傾暒碃蜻輕靘綮箐顷廎樈擏請漀慶磬鲭錆檠擎濪儬罄謦檾櫦鯖黥鑋"},
        new string[]{"Qiong","邛卭宆穷穹茕桏惸筇笻赹蛩蛬舼焪焭琼煢熍睘跫銎瞏窮憌儝璚橩嬛藑藭瓊竆瓗"},
        new string[]{"Qiu","仇叴丘芁犰扏囚玌肍朹汓丠龟邱求虬虯泅坵恘俅秋秌觓訄訅酋恷紌唒逑逎莍浗釚釻頄赇殏毬梂球蚯皳盚湫渞湭崷萩遒巯媝搝楸煪絿蛷湬鹙觩賕巰蓲緧篍璆蝤蝵銶鮂鼽穐糗醔趥鳅鞦鞧鯄蟗蘒裘鶖鰌鰍蠤龝鰽蘒"},
        new string[]{"Qu","区去厺佢戌曲驱岖佉伹刞苣诎匤阹劬取呿岴屈抾坥浀胠朐胊斪祛鸲竘袪衐菃區淭焌娶翑耝紶絇蛆躯軥趋詘詓蛐粬筁煀阒葋趍駆蕖嶇憈竬璖蝺觑駈閴趣誳敺麹麮鴝魼髷螶磲璩蟝鼁麯闃龋趨軀覰覷鼩瞿蘧黢麴鶌覻驅忂灈爠戵氍欋臞籧鰸鱋癯欔蠷齲躣鑺蠼鸜衢"},
        new string[]{"Quan","犭劝犬犮全权卷诠券佺奍弮姾峑洤荃恮泉畎拳悛辁烇牶牷惓绻埢圈婘啳铨痊硂絟筌湶葲圏犈棬椦搼勧輇觠詮瑔跧銓蜷箞綣踡韏権駩縓醛闎鳈鬈騡勸巏鰁鐉齤權虇蠸顴颧"},
        new string[]{"Que","芍却炔卻崅埆缺缼雀琷悫阕棤确硞碏鹊皵阙搉蒛塙愨榷碻確趞慤瘸燩闋闕礐鵲礭"},
        new string[]{"Qun","裠夋囷逡帬宭峮裙麇群"},
        new string[]{"Ran","冄冉苒呥姌肰衻袇染珃袡蚦蚺媣然髥髯嘫燃橪繎"},
        new string[]{"Rang","让壌穣勷儴譲壤懹蘘嚷獽攘瀼爙禳瓤穰讓躟鬤"},
        new string[]{"Rao","扰饶荛娆绕桡隢嬈蕘遶橈襓繞擾饒"},
        new string[]{"Re","若热喏躮惹熱"},
        new string[]{"Ren","人亻刃刄壬仁认讱仞仭任纫朲屻忈忍忎肕秂饪牣杒纴轫妊芢韧祍衽荏姙紉紝軔訒荵栠栣梕袵秹腍葚絍鈓飪靭靱韌魜稔餁銋認鵀"},
        new string[]{"Reng","仍艿辸扔礽芿陾"},
        new string[]{"Ri","乤日乬乫乮乭驲乶囸乽乼乺挘衵釰釼鈤馹艝鑓虄"},
        new string[]{"Rong","冗宂戎坈肜绒茸荣茙狨栄毧峵容傇烿傛媶嵘搑絨軵榵搈溶嵤嫆蓉熔穁榕榮瑢槦縙穃镕褣蝾融螎氄駥嬫嶸爃羢鎔瀜蠑曧"},
        new string[]{"Rou","厹禸肉宍柔粈脜媃揉渘葇煣腬楺瑈蝚糅輮蹂鍒鞣韖騥瓇鶔鰇譳"},
        new string[]{"Ru","入邚扖如汝杁肗乳侞茹帤洳桇挐辱铷袽渪鄏筎蓐蒘嗕媷溽缛銣褥蝡蕠儒縟鴑鴽薷嬬嶿嚅擩孺濡曘襦蠕醹顬鱬颥"},
        new string[]{"Ruan","阮软朊耎軟偄媆堧瑌腝碝緛撋輭壖瓀礝"},
        new string[]{"Rui","芮汭枘蚋桵锐甤瑞蜹緌睿鋭銳蕤蕊蕋橤叡繠壡蘂蘃"},
        new string[]{"Run","闰润閏閠潤橍膶"},
        new string[]{"Ruo","叒若鄀偌挼弱婼焫捼渃楉嵶蒻箬篛爇鰙鰯鶸"},
        new string[]{"Sa","卅仨扨苆乷钑洒飒栍脎訯鈒萨靸馺隡摋蕯颯撒潵薩簓櫒灑虄躠"},
        new string[]{"Sai","思毢躮愢揌塞嗮毸腮赛嘥僿噻賽鳃顋簺鰓"},
        new string[]{"San","三壭弎伞参叁俕閐傘毵毶散厁糁毿犙馓糝糣糤繖鏒鏾饊鬖"},
        new string[]{"Sang","丧桒桑喪嗓搡槡磉褬鎟顙颡"},
        new string[]{"Sao","扫乺掃掻埽慅搔溞骚嫂缫瘙螦繅鳋燥氉臊矂颾騒騷鰠髞鱢"},
        new string[]{"Se","色洓涩栜啬渋铯雭歮嗇瑟塞摵歰閪銫縇澁濇濏擌懎穑瘷璱澀瀒穡繬轖穯鏼譅飋鱪"},
        new string[]{"Sen","森椮槮襂"},
        new string[]{"Seng","僧鬙"},
        new string[]{"Sha","杀杉沙纱刹砂殺倽莎唦猀粆紗帹啥啑唼萐奢铩挲桬痧硰喢厦摋嗄廈蔱傻翜歃煞榝翣箑樧儍噎閯魦鲨霎閷髿鯊鯋鎩裟繺"},
        new string[]{"Shai","色晒筛酾篩簁簛曬籭"},
        new string[]{"Shan","山彡闪邖讪汕圸杉芟删刪陕苫姗姍单钐疝衫珊狦栅柵炶挻陝舢軕訕赸閃扇剡脠痁掺掸掞釤笘跚傓善晱禅椫煔骟睒剼搧銏鄯嘇僐幓煽熌缮墠墡潸澘覢嬗擅樿禪敾歚膳膻磰縿檆赡謆鯅繕蟮蟺饍鳝騸譱贍鐥灗鱓鱔羴"},
        new string[]{"Shang","丄上伤汤尚尙恦垧殇扄晌商绱觞赏禓傷蔏滳漡墒慯緔裳賞熵樉殤鋿鞝螪觴謪鏛鬺贘鑜"},
        new string[]{"Shao","勺少芍邵卲劭杓绍苕柖玿袑莦烧弰哨娋捎梢紹稍睄焼萷旓艄筲蛸綤韶輎潲蕱燒鞘髾鮹"},
        new string[]{"She","叶厍设舌社折佘舍舎虵拾厙射涉渉涻捨奢阇猞蛇赊赦設畬畲畭蛥弽揲摄摂滠慑輋慴賖賒蔎檨歙韘騇蠂懾灄攝麝欇"},
        new string[]{"Shei","谁"},
        new string[]{"Shen","什申邥屾扟沈弞伸身矤籶侁呻冞罙参诜审妽肾绅柛氠昚神珅胂甚穼姺哂侺籸矧砷谂谉莘娠峷涁甡眒眘脤敒祳堔深渗渖婶訠紳兟訷葚葠棯腎裑蜃蜄瘆椹榊慎愼蓡詵罧鉮糁蔘滲甧審糂鋠諗頣魫駪鲹薓瘮燊曋曑瞫嬸瀋鵢鯓鯵鰺讅籡覾"},
        new string[]{"Sheng","升圣生阩声呏斘枡昇狌泩苼陞珄胜竔省殅牲眚曻晟晠陹乘剰渑偗绳盛笙貹甥焺渻湦剩勝嵊琞聖鉎墭榺憴蕂縄橳繉鍟﨡聲賸鼪繩鵿譝"},
        new string[]{"Shi","酾乄十尸士饣什氏礻石矢示仕世丗辻失史市师乨似卋忕式戺竍时豕识佦亊事邿势使侍诗试呞呩始驶实実饰虱鸤旹视柹飠食柿枾炻恃恀贳施昰是祏眂蚀拾拭浉室宩姼屎屍狮峙峕兘冟适逝莳師埘铈舐眎眡時轼烒栻秲釈絁笶釶匙視谥葹遈揓湿湜湤寔崼释貰殖徥弑弒煶睗筮鈰鉂鉃鉇鉐試詩嵵獅溼溡溮塒蒒蓍蒔嗜勢觢飾軾鳲嘘適實誓鉽舓蝕瑡榯蝨箷奭餝餙鲥鳾銴駛鮖鲺噬遾嬕澨諡諟褷謚鍦螫濕簭鼫鼭鯴籂識釋襫鰘鰣鰤鶳籡襹鱰釃酾"},
        new string[]{"Shou","扌収手守收寿受狩垨首兽授涭绶售痩膄瘦綬壽夀熟艏獣獸鏉"},
        new string[]{"Shu","书殳术朮尗戍纾束抒沭陎述叔枢杸树怷荗侸咰姝竖秫紓捒倏倐荼恕書殊焂梳庶庻孰菽蒁鄃掓婌淑絉術軗黍舒疏疎裋属尌赎琡暑暏腧毹毺输数摅署竪蜀綀鼠鉥跾踈漱潄塾墅熟樞數澍潻蔬豎輸錰霔薯薥濖樹橾曙鮛癙襡璹攄藷儵瀭糬鯳鵨鶐鏣襩屬蠴贖虪"},
        new string[]{"Shua","刷耍唰誜"},
        new string[]{"Shuai","帅甩帥率衰摔蟀卛"},
        new string[]{"Shuan","闩拴閂栓涮腨"},
        new string[]{"Shuang","双泷爽漺塽慡縔霜雙﨎鏯灀骦孀孇騻鹴礵欆鷞艭驦鸘"},
        new string[]{"Shui","氵水氺说谁帨涗涚祱脽税稅裞睡誰"},
        new string[]{"Shun","吮舜順楯蕣顺橓瞚瞤瞬鬊"},
        new string[]{"Shuo","妁说烁朔铄硕欶矟搠蒴獡槊碩説說箾鎙爍鑠"},
        new string[]{"Si","厶纟巳亖丝司四死汜寺似糹伺佀厑泤兕姒祀私饲孠杫驷咝泗泀厕価俟俬洠娰枱柶牭思食飤虒肂恖鸶唜涘洍偲梩笥耜耛釲絲覗竢斯缌蛳媤嗣禗旕飔楒飼貄肆鈶鈻鉰銯榹禠锶蜤罳厮凘廝蕬嘶噝澌磃禩撕鋖緦駟燍螄蕼儩鍶鵥颸鯐瀃蟖蟴鶍騦鐁襷鷥鼶"},
        new string[]{"Song","讼宋忪松枀枩怂柗送娀诵凇倯悚耸訟梥庺淞菘崧竦硹楤頌嵩傱愯嵷誦慫憽濍檧餸聳駷颂鬆"},
        new string[]{"Sou","叟叜凁捜鄋傁獀馊搜蒐蓃廀廋嗖溲飕摉摗嗾嗽锼瞍螋艘瘶醙薮擞鎪餿颼擻藪騪櫢籔"},
        new string[]{"Su","玊夙苏苆诉泝肃洬俗速莤涑珟素粛殐梀骕宿蒅傃谡粟甦訴酥窣鹔稣肅遡嗉嫊塑塐溯溸愫榡遬僳蔌觫愬膆缩趚鋉餗碿躻樎樕憟潥潚縤穌簌鎹謖璛橚藗蹜鯂蘓蘇蘰櫯鐡囌驌鷫鱐"},
        new string[]{"Suan","狻祘笇痠蒜筭算酸匴"},
        new string[]{"Sui","夊亗芕岁尿砕虽祟浽倠谇哸荽荾绥埣眭隋随遂遀嵗煫睢睟歲歳滖碎綏粹隧隨澻嬘穂熣賥誶膸鞖燧檖禭璲濉瀡邃穗穟雖繀襚繐繸旞瓍髄譢鐆鐩髓韢"},
        new string[]{"Sun","孙荪狲隼损孫笋筍飧飱猻損搎蓀榫槂箰蕵潠薞簨鎨鶽"},
        new string[]{"Suo","所逤唆唢莎莏娑挱索桫梭挲琐琑傞惢锁睃溹溑暛蓑嗍嗦嗩摍瑣缩褨蜶趖璅簑簔縮鮻鎖鎻鎍鏁羧鱛"},
        new string[]{"Ta","他它她牠祂沓拓侤闼挞狧铊趿粏萙崉涾溚塔傝嗒鉈阘遝遢搨塌溻榙榻毾禢漯墖澾撻誻踏褟錔獭嚃燵橽濌鞜蹋鮙鳎鞳闒鶎蹹襨獺嚺闥鰰鰨譶襷鱩躢"},
        new string[]{"Tai","太夳台冭汏汰汱邰呔忲旲态孡骀苔抬坮囼肽胎钛炱炲泰舦酞菭跆鈦鲐溙颱態箈臺駘鮐燤儓薹嬯擡鮲檯籉"},
        new string[]{"Tan","叹坍坛忐昙坦贪炭怹钽袒郯倓谈啴婒探菼惔埮弹舑貪痑毯覃湠滩摊僋榃痰锬鉭碳舕谭嘆嗿嘽潭潬墰墵憛憳歎談醈瘫橝曇暺醓憻燂壇澹錟顃璮檀罈擹藫壜醰貚譚譠罎攤灘癱"},
        new string[]{"Tang","伖汤帑坣烫唐倘偒淌堂铴惝棠湯啺傥傏鄌隚蓎溏塘搪摥煻榶禟瑭膅漟嘡耥糃镋磄蝪趟躺劏膛樘橖燙薚踼螗镗糖篖赯糛螳醣餹蹚鎕鎲鏜饄闛鞺鐋鶶羰儻戃鼞爣曭矘钂"},
        new string[]{"Tao","讨夲叨弢迯匋逃咷洮涛绦桃套陶討焘萄啕掏梼绹淘祹絛詜裪滔慆搯幍嫍槄蜪瑫韬綯鞀飸鞉醄鋾駣縚縧轁濤謟騊饀鼗鞱韜饕"},
        new string[]{"Teng","疼痋幐腾誊漛滕邆螣縢膯駦謄儯藤霯騰鰧籐籘虅鼟驣"},
        new string[]{"Te","朰扨忑忒特脦铽罀慝躻鋱蟘蘰鐡"},
        new string[]{"Ti","体戻屉洟厗剃荑剔俶倜逖涕挮绨悌惕屜掦逷啑偍梯悐笹躰惖替稊锑鹈罤啼遆媞崹提揥渧缇惿嗁裼瑅綈骵碮褆褅睼歒銻踢緹徲蕛殢漽髰薙蹄醍趧蹏鍗鳀謕嚏擿鬀鬄鵜鮷题題嚔瓋騠鶗鶙鯷軆籊趯鷉鷈體禵鷤"},
        new string[]{"Tian","天田兲佃沺屇忝恬畋畑殄胋畠钿倎菾唺悿掭添淟甜甛婖酟靔腆觍晪琠湉填塡搷嗔阗睓痶碵瑱舔緂餂賟覥磌窴錪黇鴫璳闐靝舚鷆鷏"},
        new string[]{"Tiao","芀旫条佻岧岹苕迢庣宨挑恌祒祧朓脁晀调條萔眺窕笤粜絩聎蓚蓨覜誂趒跳龆蜩樤斢窱鋚鲦鞗髫鯈嬥鎥齠鰷糶"},
        new string[]{"Tie","帖呫怗贴铁蛈萜聑貼鉄飻僣銕餮鐵驖"},
        new string[]{"Ting","厅邒庁圢汀廷听町甼侹耓涏厛庭娗莛亭挺烃烶梃珽脡铤桯烴停葶婷嵉蜓渟綎艇筳誔楟榳鋌閮霆頲蝏聤鞓諪聴颋鼮聼廰聽廳"},
        new string[]{"Tong","仝同彤佟侗峂庝峒峝统垌恫恸炵茼哃狪捅浵通烔晍桐砼蚒痌秱铜眮桶童筒痛粡統絧綂筩赨詷酮鉖蓪嗵勭僮樋熥慟銅鉵餇鲖憅獞潼燑氃橦犝曈朣膧穜瞳鮦衕"},
        new string[]{"Tou","亠头投妵紏透偷偸媮婾敨骰鋀頭黈鍮鯳蘣"},
        new string[]{"Tu","土圡凸吐汢図兎迌宊秃禿怢钍兔图凃突悇徒荼莵峹途庩涂涋唋捈捸堍菟梌屠釷稌痜葖堗揬溌湥塗蒤嵞瘏腯鈯筡酴跿瑹嶀廜圖圗潳鋵馟駼鍎鵌鵚鵵鶟鷋鷵鼵"},
        new string[]{"Tuan","团団抟彖猯湍湪圕煓剸褖畽團慱漙摶墥槫貒篿疃檲鏄糰鷒鷻"},
        new string[]{"Tui","弚忒退侻俀娧推煺腿楿蜕蛻褪隤僓蓷尵燵橔骽躾蹆頹頺頽駾魋藬蘈穨颓蹪"},
        new string[]{"Tun","屯氽芚饨吞呑坉囤忳旽涒軘豚豘蛌飩鲀朜焞褪噋魨黗霕暾臀臋"},
        new string[]{"Tuo","乇阤仛讬彵饦托扡驮汑妥佗陁陀杔狏岮坨侂咜咃驼沱沰拓拖拕说侻柁柝毤鸵砣砤袉袥莌捝挩託飥涶萚唾庹紽脱脫堶椭詑酡跎跅楕毻碢馱馲駄箨嶞槖嫷魄魠橢駝駞橐鮀鴕鵇鵎鮵鼧騨蘀鰖鼍驒籜驝鼉"},
        new string[]{"Wa","屲瓦凹佤邷穵咓劸娃哇挖洼砙畖窊袜瓸娲媧啘聉窐蛙嗢嗗瓾甅腽搲溛漥窪膃鼃襪韈韤攨"},
        new string[]{"Wai","外咼歪喎崴竵顡"},
        new string[]{"Wan","乛丸万卐卍芄刓汍纨完岏抏妧忨杤玩宛弯紈笂盌剜倇莞唍挽捖捥帵绾埦菀萖琓梚脘脕惋烷婠婉晚晥貦晩晼腕皖椀琬萬塆湾碗畹睕頑蜿綰綩輓輐蔓潫澫豌踠鋄鋔翫錽薍顽瞣蟃鎫贃贎彎灣壪"},
        new string[]{"Wang","亾兦亡尢尣罓王罒网仼妄汪尫彺尪忘迋枉尩旺往徃罔徍莣蚟菵惘望蛧暀棢辋蝄網朢輞誷魍瀇"},
        new string[]{"Wei","葨卫囗韦为厃未危圩伟伪位苇芛违帏尾围囲闱纬沩炜玮味委苿威峗峞胃畏洈洧為韋軎叞涠浘桅烓捤娓荱诿谓隗隈隇偎偽偉萎菋帷尉逶唯崣梶硊硙惟维痏骩骫骪圍愄愇湋渭溈渨爲琟崴嵬嵔喂喡喴揻揋遗違廆幃媦媁媙猥猬葳蒍葦徫微瑋椳椲楲煨煒煟腲韪暐溦艉痿詴維鲔潍墛碨蜼蜲鄬僞蔚蓶撱嶉蔿蝟蝛磑慰熭犚寪潿潙覣緯緭諉醀踓韑頠鮇謂餧懀罻薇薳嶶儰螱燰濰濻餵闈鍏鍡鳂魏褽鮠鮪韙颹癓轊瀢壝矀藯鳚霨鏏韡鰃鰄覹蘶巍犩饖霺衛讆躗欈亹躛讏斖葨"},
        new string[]{"Wen","文问刎伆芠吻呅妏彣抆汶纹免炆肳呡闻昷莬蚊蚉紊紋問渂珳阌脗桽塭温揾雯絻搵溫辒殟榅瑥稳榲聞瘟瘒駇馼鳼鴍魰緼蕰輼豱螡閿閺闅饂鳁鼤蟁鎾轀穏繧鞰顐穩鰛璺鰮闦"},
        new string[]{"Weng","瓮翁奣勜蓊滃塕嗡嵡暡瞈鹟螉聬蕹甕鎓罋攚鶲齆"},
        new string[]{"Wo","仴沃我肟臥枂卧挝涡倭莴萵偓唩涴渦涹捰捾婑婐猧媉焥硪窝握渥喔幄遤窩腛蜗楃斡蝸瞃踒龌臒瓁濣齷"},
        new string[]{"Wu","兀亡兀五乌无勿午毋戊朰厼务阢邬伍仵弙屼污汙汚扤圬坞巫岉妩庑迕芴芜呜吴吳呉杌杇怃忤物旿玝武忢矹於钨敄卼侮俉郚诬误屋洿浯洖捂逜娒娪峿陚倵唔茣莁務烏悟悮悞恶粅窏梧焐牾晤祦珸啎剭娬婺嵍骛隖鄔珷铻無痦鹀靰誈雾雺鹉碔蜈楾嗚奦嵨摀塢溩寤熃熓舞瑦歍躵鹜誣誤鋈鋙躻箼憮廡嫵潕墲蕪儛橆甒璑螐窹鴮霚瞴鼿齀鯃霧鵐鎢蟱騖鵡譕蘁鯲鼯鶩躌鰞鷡"},
        new string[]{"Xi","匸习夕兮邜卌巪汐凩吸戏忚西系扸屃饩希卥细呬郋郄怬析昔忥肸肹矽穸盻怸枲恓恄巼郗郤係俙咥茜饻洗徆席奚娭狶浠绤屖屓莻莃唏唟悕夞栖牺氥欯息玺裃铣硒釳釸細習赥悉晞琋欷梻桸觋烯焁焈惜唽菥淅渓阋徙葸葈喜喺喸傒隙鄎塈焟焬椞犀晰晳惁腊翕翖舾鈢硳稀睎舄舃粞趇裼锡皙鉨鉩綌赩禊椺煕慀隟厀蓆蒠蒵徯嵠媳溪漇漝屣嶍蓰僖熙熈墍熄熂榽犔覡緆豨稧蜥聢趘餏瘜磎縅覤槢膝戯憘蕮嘻噏嬉嬆潝潟澙噺薂凞隰熹戱熺熻憙禧暿樨橀橲歙歖縘諰錫窸螅螇褶躾黖袭貕蹊蟋磶礂瞦謑豯縰谿豀犠檄燨戲壐巂繥謵鎴蟢虩糦蹝餼鬩鵗鯐鳛霫繫璽鏭鐊譆醯觹隵酅嚱巇爔犧曦闟飁騱饎騽霼鰼羲觽襲鼷鱚鸂蠵矖屭囍觿鑴躧驨衋"},
        new string[]{"Xia","丅下吓圷匣侠呷狎疜虾狭俠陜峡炠柙祫珨烚峽夏狹埉唬陿假梺谺硖翈舺硤閕遐傄葭厦舝煆敮暇瑕閜颬筪碬睱辖瞎蕸磍諕蝦縖赮魻霞罅鍜轄懗夓鎋鎼黠鯱騢鏬鰕鶷"},
        new string[]{"Xian","见仚仙屳奾纤先咞闲伭佡县苋岘忺氙杴贤现祆秈臽狝妶线苮冼咁限弦险陥咸宪挦洗涎姭籼胘盷県枮显毨烍珗蚬娴娊猃峴崄涀垷哯陷険莶莧埳掀娹婱蚿絃衔舷赻铣铦馅現晛痫睍筅絤蛝鹇湺缐羡啣閑閒嗛羨尠尟塪搟嫌蜆粯跹跣酰锨禒腺献甉誢綫嘕僊僩僲僴鲜銜銑銛銽鋧韯險嫻嫺撏撊澖線誸箲賢稴暹憪憸橺橌憲諴醎輱嬐嶮獫薟餡縣鍁錎鍌韱鮮藓獮壏豏繊褼癇癎瞯燹藖顕麲衘馦幰瀗攇臔蹮譣礥糮櫶獻攕孅廯蘚霰鹹麙鶱羬纎贒躚襳玁纖鼸鷼鷳鷴顯韅鑦灦鱻"},
        new string[]{"Xiang","乡芗向瓨详享佭降亯庠巷响姠饷相蚃香珦栙祥晑郷鄉鄊厢象缿絴項飨翔鄕廂葙萫湘缃项勨像詳跭想銄鲞餉薌嶑曏橡箱緗膷襐蟓蠁襄鮝嚮鯗鐌響饗骧忀麘欀瓖镶鱌纕鑲鱶饟驤"},
        new string[]{"Xiao","小灱灲孝肖枭効呺哓咲侾削骁洨枵恔烋校效晓鸮消涍庨绡宵宯郩逍俲哮虓笑訤啸萧婋猇崤淆梟焇敩硝硣窙暁殽傚销痚痟翛揱綃筱筿詨蛸歊箫嘐嘨嘋潇誟踃銷霄誵撨獢嘵憢皛膮曉嘯蕭彇謏颵篠魈鴞鴵簘藃皢穘蟏蟂熽歗嚣瀟蟰簫髇斆櫹斅囂嚻髐鷍﨧驍蠨毊虈"},
        new string[]{"Xie","写叶协劦邪旪伳灺泄泻绁些協胁祄缷契奊峫卸洩挟拹炧炨恊垥挾屑卨娎脇脋脅械紲徢偕偰偞谐焎斜禼烲屟渫揳谢亵媟猲絏絬翓絜血解瑎綊楔歇嗋僁携愶塮熁冩榭榍膎褉鲑靾鞋緳蝎蝢寫暬縀緤勰噧撷擕屧缬澥懈邂獬嶰廨薤薢糏諧衺韰褻謝燮燲夑瀉擷藛嚡鞢鞵齘繲蟹蠏蠍瀣爕襭齛齥纈攜孈齂躞讗龤"},
        new string[]{"Xin","忄心阠邤伈伩囟辛芯忻妡孞炘昕杺枔欣盺信俽莘軐惞訢訫脪锌焮鈊新歆馸鋅廞噷薪嬜镡襑衅顖鐔馨舋鑫釁馫"},
        new string[]{"Xing","兴刑邢饧行杏形陉郉侀幸姓性狌洐型星哘陘荥荇钘省莕骍倖娙垶涬悻婞硎铏鈃葕惺猩煋瑆腥蛵睲緈觪銒鉶滎鋞篂箵謃醒興鮏餳騂觲曐擤皨嬹臖鯹"},
        new string[]{"Xiong","匂凶兄兇匈讻芎诇忷汹洶恟哅胸胷訩詗雄焸焽詾熋敻夐熊賯"},
        new string[]{"Xiu","休朽秀岫峀俢苬庥咻修羞绣烌袖珛脩臭脙琇宿鸺臹锈貅嗅馐滫溴潃綉褏褎髤樇銝璓銹糔髹螑鎀嚊鵂鮴繍饈鏅鏥繡鱃鏽齅飍"},
        new string[]{"Xu","许吁圩戌旭旴序汿芧伵侐卹诩呴姁怴沀疞盱砉胥昫欨恤浒洫叙俆冔烅徐垿欰栩晇珝珬畜訏殈酗許裇虚虗敍敘绪续烼勖勗偦谞湑溆媭婿喣壻揟欻朂虛聓訹絮須须﨏頊綇続詡賉暊禑楈慉煦滀蓄蒣蓿鄦漵潊嘘墟槒緒聟瞁稰盢銊需魆魣稸蝑糈緰緖縃歔噓嬃獝蕦藇歘醑諝諿顼盨譃燸藚繻魖驉續鑐鬚鱮"},
        new string[]{"Xuan","玄吅县轩昍券泫怰炫绚咺选宣昡玹晅袨眩铉痃弲烜軒谖眴衒梋琁琄旋悬絢萱萲媗愃愋揎喧塇渲煖煊蓒蜁瑄楦楥暄鉉碹睻蔙嫙漩選儇蝖翧暶禤璇箮鋗諠諼颴鞙镟嬛蕿懁縼檈駽鍹璿繏翾蠉癣矎蘐藼鏇譞懸癬贙"},
        new string[]{"Xue","彐穴斈吷坹学乴茓狘峃岤削泶袕疶鸴桖谑雪蒆靴趐踅膤樰學壆噱薛嶨辥謔辪瞲澩燢轌鞾瀥鳕觷鱈鷽"},
        new string[]{"Xun","卂讯训廵伨巡迅寻驯汛旬杊坃询侚郇畃紃勋荤荨荀逊迿徇巺恂浔洵狥峋浚埙栒桪殉珣毥訊訓訙焄奞偱勛循尋巽揗殾稄詢馴塤遜鄩熏愻窨鲟潭潯勲蕈噀噚薫勳璕燖燅樳攳駨獯壎薰嚑燻臐曛蟳矄蘍爋壦纁醺顨鑂鱏鱘灥"},
        new string[]{"Ya","丫劜圠牙轧疋圧伢亚襾冴压厌厊讶吖覀呀芽迓庌亜岈犽押亞厓庘軋枒玡疨鸦砑哑挜娅垭唖俹鸭蚜笌琊桠氩孲痖铔訝啞埡堐崖崕涯婭猚掗揠猰釾聐氬椏雅圔睚瘂稏窫漄蕥襅鴉鴨衙錏壓鵶鯲齖鐚鑓軈齾"},
        new string[]{"Yan","讠延夵厌闫妍妟沇严阽芫抁觃言訁炎炏昖牪兖奄郔乵沿岩姲姸娫匽俨弇咽兗莚研砚衍彦彥埏恹狿烟烻铅盐晏珚殷胭唁剡剦验宴娮艳覎訮酓閆阏阉阎崦淹淊厣偃偐郾隁啱萒谚琂眼硏焔焉掩揜堰扊愝焰焱棪硯筵琰腌晻敥猒喭喦隒湮渰渷嵒嵃嵓遃雁綖蜒詽鳫滟溎鄢傿揅歅硽罨裺椻椼楌煙塩墕熖褗碞暥厭蔅演漹嵼嫣酽醃蝘魇餍鴈嬊嶖谳樮戭燕赝燄噞厳閹閻躽鬳虤諺縯鴳嚈嬮檐懨曕篶懕檿酀黡騐験顔顏軅艶厴嚥嚴嬿巌壛簷贋臙甗曣櫩爓醶騴黤鶠鰋齞龑颜鷃黭黬黫儼巖巗灔孍壧贗鼴顩驗饜魘醼讌觾鼹鷰曮巘巚囐礹齴艷鹽驠釅黶灎灧豓讞豔麣灩"},
        new string[]{"Yang","卬央扬阳阦仰佒飏炀杨旸氜怏疡钖泱坱佯劷抰咉姎岟垟养徉洋柍炴胦殃昜氧秧珜眏鸯烊样恙陽眻紻痒蛘詇傟崵崸揚楧羊楊煬鉠飬雵蝆瑒氱暘敭慃瘍養様漾鞅駚羏樣鍈諹輰鴦鴹羕鍚懩瀁攁颺癢礢鰑霷鸉"},
        new string[]{"Yao","幺爻夭吆仸尧约宎妖岆狕侥苭抭尭殀肴祅杳枖疟穾要柼钥轺垚荛药峣姚咬倄烑珧陶袎舀窅窈眑窑窔訞铫偠傜谣葯葽喓婹崾堯揺詏筄軺摇搖滧溔愮腰楆猺徭媱嗂蓔遥遙榚榣暚瑶瑤熎飖摿覞餆靿鴁窯窰鹞磘獟嶢嶤徼邀薬鴢餚鼼闄謡謠繇艞鎐鳐藥燿曜颻矅騕耀蘨邎纅鷂齩顤鰩鷕鱙讑"},
        new string[]{"Ye","丆也ㄝ业叶吔邪爷曳曵邺冶亪抴夜耶枼拽捓亱咽頁倻捙枽烨晔野铘掖揶埜液谒葉殗腋爺瑘椰页馌業煠暍墷漜嘢僷曅璍燁歋鋣皣瞱曄鄴噎潱擛靥澲壄嶪嶫鎁謁餣鍱瞸曗擨擫擪爗礏鎑饁鵺鐷蠮靨驜鸈"},
        new string[]{"Yi","乁一乙乂义亿已弋弌忆以刈艺辷艾议匜阣匇凧仡仪肊衤钇伊伇亦异芅迆忔圯夷屹尾沂役宐坄抑壱苡苅译诒呓吚冝劮佁佚医杝杙攺矣耴邑衪易枍秇祎依佾侇呹呭诣苢迤迱绎怡怿怈炈宜驿泆沶饴狋峄峓洢浂帟帠奕姨贻轶恞拸迻荑弈庡咿咦俋瓵珆玴疫枻昳蚁羿舣釔食酏貤訑笖袘袣欭巸夞扅扆栘栧桋益眙胰倚唈谊逘挹悒垼宧弬浥浳渏猗埸埶逸萓萟偯勚郼移悘悥殹铱痍異畩蛇翊翌訲訳豙豛釴隿骮跇鳦衣鈘鈠鉯詒詍貽軼蛡蛜蛦椅棭椬敡旑晹鄓遗殔焲揖壹崺湙幆媐溢獈缢嗌兿義亄暆椸痬睪禕意蛾裿竩詣誃肄裛跠飴頉駅銥銯疑蜴稦膉瘗榏旖勩廙蓺漪潩嫛嫕嬄撎熠熤熪熼遺億儀槸瘞鹝鹢镒毅篒誼輢黓踦頤頥艗縊瑿螠螘螔褹穓瞖鹥瘱敼曀彛劓薏噫燚殪墿圛夁懌憶嬑嬟彜澺嶧嶬嶷寱寲燡燱曎歝斁檥檍臆繄翳翼簃賹貖顊鴺鮨鮧黟羠醫鎰贀謻毉癔礒镱檹彝藝藙彞鏔豷繹繶艤蟻颐裔霬鯣鶂鶃鶍鶎顗饐籎醷醳譯議譩轙蘙瀷囈觺鐿鷊鷁鷖讉懿襼鷧驛黳齮鷾鸃虉讛齸"},
        new string[]{"Yin","廴冘引尹囙印因岃乑阴阥吟吲犾圻饮烎斦侌茚茵荫姻骃洇泿洕垠垔胤音珢蚓粌訚訔垽峾栶氤殷圁狺荶陰隐隂陻婬寅凐崟崯淫訡裀赺秵铟银絪筃龂鈏鈝飲湚堙堷愔淾猌喑婣廕鄞隠蔭蒑禋溵滛飮靷碒慇瘖輑朄窨酳龈銦銀夤蔩噖殥鞇趛誾緸癊慭磤璌憖憗瘾諲駰霒鮣檃隱噾懚濥濦嶾霠闉螾蟫檭檼嚚蘟霪齗韾櫽齦癮讔鷣"},
        new string[]{"Ying","迎应応盁英茔荥荧郢栍映盈矨桜珱偀莺莹浧渶萤营萦営梬婴媖绬愥蛍硬朠暎煐瑛萾溁溋滢蓥僌楹塋媵嫈碤锳緓罂賏蝇蝧撄摬缨熒甇嘤潆璎潁樱影蝿膡禜瑩罃縈褮穎瘿螢鹦鴬霙頴嬴營噟藀濙濚濴應嬰韺闏赢膺覮謍鹰蠅鎣颍瀅瀛瀯瀠攍巆颖鶑鶧鐛颕譍贏罌巊孾攖孆櫿瀴蘡嚶廮灐櫻瓔譻礯鶯鑍癭籝纓蠳鱦鷪灜鷹鸎籯鸚"},
        new string[]{"Yo","育哟唷喲罀"},
        new string[]{"Yong","永用甬佣苚咏泳拥怺栐俑勇勈柡悀涌埇痈砽邕恿庸蒏喁湧愑惥硧詠蛹雍愹塎嗈鄘嵱彮傭嫞墉滽慵踊慂鲬牅擁澭壅噰郺踴镛臃醟雝顒鯒癕鏞鳙鰫颙廱灉鱅鷛饔癰"},
        new string[]{"You","又尢尤友右幼由甴有优佑卣邮苃丣沋攸忧犹酉狖孧怞怮肬油泑呦侑羑诱哊迶祐幽牰柚宥姷峟囿怣疣庮峳栯秞铀逌唀浟莜莸莠郵偤逰铕梄訧悠聈蚰蚴釉貁鱿猶遊游湵亴楢禉猷鲉鈾酭麀蜏輏誘褎銪駀滺蕕font>牖牗槱魷蝤蝣憂輶鮋黝繇優鄾瀀嚘懮鼬櫌櫾纋耰"},
        new string[]{"Yu","袬与于亐予肀込驭邘玉羽聿伃伛芋芌宇迂迃吁屿扝扜纡圫饫忬扵汩杅欤玙玗余妤妪谷臾穻衧盂鱼雨郁陓欥育於禺禹挧昱俣俁茟茰狱俞兪语秗虶舁紆竽酑砡钰谀狳娱娛娯俼祤桙峪浴彧馀圄圉域堉惐淤渔淯淢悆欲偊隅鄅隃匬菀菸萸阈尉庾谕唹逳盓敔粖雩魚馭飫骬粥畬硲硢裕铻矞鹆逾遇喁喻喅喩御庽寓媀萭萮琙腴棫棛棜楰焴渝湡嵎嵛崳揄愉斞堣堬滪煜牏觎榆楀楡愚愈瑜瑀歈蓣蒮傴寙瘀瘐稢罭與艅鈺虞誉預語銉輍箊舆緎褕窬蜮蜟毓睮瘉獄嫗僪隩蔚戫漁嶎潏熨慾歶薁蓹蕍遹稶蝓窳鋊諛豫頨雓餘龉鳿鴥鴪鴧閾预覦諭錥貐踰噳嬩蕷燠燏澦澞嶼懙歟璵儥鍝輿螸禦礇鹬魊鮽鵒髃麌癒穥礖礜篽醧謣斔櫲旟籅饇騟鰅霱轝譽鐭蘌蘛雤驈鬻鷠齬欎鷸鱊籞鸆鸒齵欝鬰軉鬱籲灪爩龥"},
        new string[]{"Yuan","元円夗贠邧芫员远沅园囦肙鸢杬妴苑茒院剈垣爰盶怨貟衏笎蚖眢鸳垸圆原員冤逺厡寃涴渊渁渆渕湲淵猨媛葾傆圎援掾惌鼋缘袁蜎鹓裷塬園圓棩禐瑗遠蒝蒬嫄媴猿源溒辕榞榬裫褑愿鳶箢駌魭縁緣蝯蜵蝝褤螈橼圜薗噮鋺鴛黿轅謜鎱願鵷邍嬽櫞灁鶢騵鶰鼘羱鼝厵"},
        new string[]{"Yue","曰月曱戉乐刖约岄抈妜礿泧玥岳恱哕说钥栎約蚏蚎軏钺阅悦悅捳跃跀越粤鈅鉞粵箹閲閱篗噦嬳樾嶽龠矱籆黦瀹蘥爚禴躍籥鸑鑰籰鸙"},
        new string[]{"Yun","匀勻允云孕阭伝运夽员妘狁抎抣沄芸纭囩枟昀郓郧陨秐眃恽畇晕耺耘紜荺涢鄆殒酝雲鈗愠惲缊隕鄖蒀喗運傊溳蒕蒷慍愪煴筠筼暈韫腪氲韵馻褞氳熅熉殞熨磒蕴蕓澐奫蝹鋆醖薀篔賱縕縜橒赟醞餫霣韞韗馧藴蘊贇韻齫齳"},
        new string[]{"Za","帀扎匝杂沞咂咋乽拶沯砸桚楾韴鉔雑錺魳橴襍雜臜囃囋臢雥"},
        new string[]{"Zai","仔扗在再灾災岾甾洅哉宰载烖栽崽傤渽溨載酨睵儎縡賳"},
        new string[]{"Zan","兂咱拶昝偺寁揝喒暂暫糌賛噆撍赞橵錾篸儧鄼酂攅濽簪簮蹔鵤鏨贊瓉攒瓒鐟鐕儹酇囋攢讃灒禶瓚趱襸讚趲饡"},
        new string[]{"Zang","驵匨奘弉牂脏赃塟葬賍賘蔵臧駔銺藏臓臟贓髒欌贜"},
        new string[]{"Zao","早皂皁灶枣栆蚤造唣唕梍棗凿傮喿煰艁慥遭噪澡簉糟璪竃薻燥醩蹧藻躁趮譟竈鑿"},
        new string[]{"Ze","仄庂汄则択沢泽泎责昃昗择迮侧咋則捑帻啧啫舴笮責崱硳滜溭矠箦幘嘖嫧蔶赜樍歵諎瞔皟擇簀賾謮礋襗蠌齚齰鸅"},
        new string[]{"Zei","贼戝賊鲗鞐蠈鰂鱡"},
        new string[]{"Zen","怎谮譖"},
        new string[]{"Zeng","曽综曾锃増鄫缯鋥增憎赠熷橧甑璔磳矰罾繒鬵贈譄囎"},
        new string[]{"Zha","扎乍札轧吒厏诈灹苲咋拃抯闸奓挓咤炸眨查栅柞柤痄哳宱砟紥紮蚱蚻铡偧猹揸喳喋渣溠詐牐閘鲊楂槎蓙搾摣劄榨皶鲝蜡箚觰霅樝皻鮓鮺耫醡鍘譇譗齄齇"},
        new string[]{"Zhai","宅侧责择夈粂窄捚斋柴债斎砦祭債鉙翟寨榸摘瘵檡齋"},
        new string[]{"Zhan","占佔沾斩枬栈毡飐战旃栴桟展站盏蛅粘飦崭偡菚斬绽棧湛趈詀琖惉盞詹閚搌戦辗榐嶄嶃颭綻輚嫸醆嶘谵薝邅噡嶦橏戰霑虥虦輾氊氈瞻鹯襢覱轏旜譫譧饘鳣驏蘸驙魙鸇鱣黵讝"},
        new string[]{"Zhang","蟑丈仉长仗扙杖张帐胀账粀涨涱帳張章脹掌痮鄣障傽蔁遧幛嫜獐嶂彰漳漲墇慞粻賬樟暲璋幥瘴瘬餦瞕礃鏱騿麞鱆蟑"},
        new string[]{"Zhao","爫爪召兆佋诏找钊招沼巶妱枛昭狣炤垗赵笊肁釗着啁棹旐朝罀詔鼌鉊瑵罩照肇肈箌趙嘲駋鍣曌燳鮡櫂瞾皽羄"},
        new string[]{"Zhe","厇这折歽者矺砓籷柘虴袩埑浙這哲粍啠淛辄着晢晣悊蛰喆詟谪蜇褚锗蔗遮嗻摺輒嫬赭磔輙踷銸樜鹧辙褶鍺螫蟅蟄嚞謫謺鮿轍讁鷓襵讋"},
        new string[]{"Zhei","这"},
        new string[]{"Zhen","阵圳贞纼诊针枕甽侦抮挋浈轸侲陣弫帧姫鸩昣胗珍珎貞針朕祯桢栚砧疹紖畛袗真眕眞屒帪振赈偵眹紾聄酙軫覙診裖葴幀寊遉塦揕湞溱搸缜嫃獉蓁蒖絼椹楨禎斟甄鉁誫賑瑧禛榛碪殝潧稹镇箴鋴震駗鴆錱樼縝縥臻澵薽鍼轃鎭鎮辴籈鬒黰鱵"},
        new string[]{"Zheng","丁氶正争佂证抍怔爭诤郑征姃糽狰峥炡政埩挣拯烝脀钲眐症睁铮聇掟掙崝崢猙媜揁幁筝証諍踭鉦睜靕晸塣徰蒸鄭愸箏錚撜整篜鲭鬇鴊證癥鏳"},
        new string[]{"Zhi","之夂氏支止卮只汁执阯劧芝芖旨至豸志忮识纸巵址坁芷帋伿扺扻吱汦沚汥治泜妷抧侄郅厔制帜帙迣茋坧垁织质枝炙祉肢直知砋衹衼胝胑秖秓祗祑栀枳栉柣轵恉峙庢庤陟俧指挃姪咫洔洷淽娡值倁値茝徏狾轾贽桎栺祬挚晊秩脂歭袟聀紙疻疷釞致隻翐貭觗訨趾痔痓铚鸷畤窒紩职秷梽梔猘乿埴執徝偫剬掷淔滞骘傂崻椥植殖智彘戠禃絷蛭犆痣跖軹臸黹雉筫輊跱酯锧置綕禔稙稚瓡廌寘搘搱滍滯潌摭徴榰墆墌蜘疐瘈覟誌銍製馶馽鳷質觯鋕踯踬慹憄膣稺摯漐熫徵幟摨嬂潪瀄擳隲旘璏膱樴緻鴙駤鴲袠縶螲櫛懥穉劕儨擿擲藢懫蟙職織蹢蹠贄觶軄襧鯯騭櫍瓆鼅礩豑躑騺驇蘵鷙躓鑕豒"},
        new string[]{"Zhong","中众仲伀汷彸刣妐妕忪狆炂祌忠肿泈终茽种钟柊衳衶盅重舯蚛冢偅眾終衷筗鈡堹喠尰媑煄腫歱塚幒蔠锺種瘇蜙銿徸諥踵螤鴤螽鍾鼨衆蹱鐘籦"},
        new string[]{"Zhou","州纣舟肘伷诌侜周咒呪绉帚宙妯疛胄祝紂洲轴炿昼咮冑诪荮调郮烐辀酎珘皱矪粙徟鸼舳晝淍婤週菷啁喌葤晭赒軸詋粥睭甃輈銂碡箒賙僽皺駎輖縐駲霌噣鵃嚋骤謅繇盩騆籀鯞籕籒譸驟"},
        new string[]{"Zhu","丶主宁术朱伫竹住佇芧苎助劯纻坾贮驻杼宔迬拄拀注侏诛邾竺笁祝茱茿洙柚柱柷殶壴炷炢烛珠竚眝株逐莇陼诸祩疰罜窋砫硃笜袾蛀紵紸舳著逫庶帾渚秼铢猪嵀属煮煑铸跓絑蛛筑貯軴詝註誅筯褚瘃跦鉒飳馵蓫蕏潴槠墸銖蝫翥箸諸豬鋳駐橥樦濐嘱燝駯麈麆築篴篫簗鴸鮢燭瞩瀦藸鼄鯺蠋櫫櫧躅鱁蠩鑄劚灟囑孎鸀欘曯爥斸矚蠾钃"},
        new string[]{"Zhua","爪抓挝撾檛膼簻髽"},
        new string[]{"Zhuai","转拽跩"},
        new string[]{"Zhuan","专传沌灷转叀孨専砖転專啭堟蒃鄟腞瑑僎嫥塼赚馔撰瑼甎磗膞篆篹竱磚諯賺襈縳轉蟤顓譔饌颛籑囀鱄"},
        new string[]{"Zhuang","庄壮妆妝状壯庒狀荘壵莊奘桩娤梉焋粧湷僮樁幢撞糚装裝戆"},
        new string[]{"Zhui","坠沝隹追笍骓娷缀缒惴甀腏椎膇锥硾畷綴赘墜縋諈醊錣錐贅礈騅鵻鑆"},
        new string[]{"Zhun","屯迍宒肫窀谆准啍埻訰凖準稕綧諄"},
        new string[]{"Zhuo","彴犳汋圴灼妰拙叕茁卓浊炪斫烵桌浞捉诼倬丵酌着啄啅涿棁梲娺椓棳焯斮斱琢琸晫硺罬窡窧禚斲槕撯擆劅諑諁鋜篧濁缴斀斵濯擢穛謶镯櫡鵫鐯躅蠗灂鐲鷟籗穱蠿籱"},
        new string[]{"Zi","子仔吇芓孖字自杍孜姊姉吱茊胏秄矷甾秭虸耔籽茈茲荢茡咨呰姿姕兹赀资倳剚紎栥玆牸恣笫赼釨眦眥梓秶谘菑缁崰淄渍滋湽嵫辎孳葘鄑嗞啙椔粢紫胾胔資貲觜訾訿禌锱嗭孶滓趑龇鈭漬蓻镃榟稵緇緕輜魸鼒髭鲻趦錙輺諮澬鍿鎡頾頿鯑鯔鶅齍鰦纃齜"},
        new string[]{"Zong","纵宗枞昮总疭倊倧偬猔综捴骔惣腙棕葼揔搃堫惾焧猣嵏嵕傯蓗椶朡碂粽稯嵸摠潈綜総緃縂緫緵翪踪踨熧糉蝬磫瘲燪縦總縱繌鍐鬃蹤豵騌騣鯮鬉鬷糭鯼鑁"},
        new string[]{"Zou","赱邹走驺奏诹陬郰菆掫揍鄒棷棸緅箃諏鄹鲰黀鯫騶齱齺"},
        new string[]{"Zu","卆阻诅足苴鼡卒组乼俎祖珇爼租唨哫崒崪族菹組詛葅椊蒩靻箤踤镞鏃"},
        new string[]{"Zuan","钻鉆赚篹繤缵纂纉劗攥躜鑚籫纘躦鑽"},
        new string[]{"Zui","咀厜冣栬脧絊酔晬祽最觜辠稡罪槜嶊嗺酻醉蕞嶵嘴檇樶鋷錊檌噿璻蟕纗"},
        new string[]{"Zun","捘尊僔銌遵噂嶟撙樽罇繜譐鐏鳟鷷鱒"},
        new string[]{"Zuo","左阼作佐坐怍岞岝咗胙昨祚侳座莋秨唑袏笮做捽琢葃葄筰鈼飵稓嘬撮穝繓糳"}
        };
        #endregion
        
        #endregion

        #region （public）汉字转换成简拼 _ConvertHanZiToJianPin

        /// <summary>
        /// 汉字转换成简拼
        /// </summary>
        /// <param name="strHanZi"></param>
        /// <returns></returns>
        public static string _ConvertHanZiToJianPin(string strHanZi)
        {
            if (string.IsNullOrEmpty(strHanZi))
                return null;
            Encoding ed = Encoding.GetEncoding("GB2312");
            if (ed == null)
                throw (new ArgumentException("没有找到编码集GB2312"));
            char[] charary = strHanZi.ToCharArray();
            byte[] bAry = new byte[2];
            StringBuilder rtnSb = new StringBuilder();
            for (int i = 0; i < charary.Length; i++)
            {
                bAry = ed.GetBytes(charary[i].ToString());
                if (bAry.Length == 1)
                {
                    rtnSb.Append(charary[i]);
                    continue;
                }
                bool isFind = false;
                for (int j = 0; j < _Allhz.Length; j++)
                {
                    if (_Allhz[j][1].IndexOf(charary[i]) != -1)
                    {
                        rtnSb.Append(_Allhz[j][0].Substring(0, 1));
                        isFind = true;
                        break;
                    }
                }
                if (!isFind)
                    rtnSb.Append(charary[i]);
            }
            return rtnSb.ToString();
        }

        #endregion

    }

    #region DataRow、DataTable转换实体扩展方法

    /// <summary>
    /// DataRow、DataTable转换实体扩展
    /// </summary>
    public static class DataExtensions
    {
        /// <summary>  
        /// DataRow扩展方法：将DataRow类型转化为指定类型的实体  
        /// </summary>  
        /// <typeparam name="T">实体类型</typeparam>  
        /// <returns></returns>  
        public static T ToModel<T>(this DataRow dr) where T : class, new()
        {
            return ToModel<T>(dr, false);
        }

        /// <summary>  
        /// DataRow扩展方法：将DataRow类型转化为指定类型的实体  
        /// </summary>  
        /// <typeparam name="T">实体类型</typeparam>  
        /// <param name="dateTimeToString">是否需要将日期转换为字符串，默认为转换,值为true</param>  
        /// <returns></returns>  
        /// <summary>  
        public static T ToModel<T>(this DataRow dr, bool dateTimeToString) where T : class, new()
        {
            if (dr != null)
                return ToList<T>(dr.Table, dateTimeToString).First();
            return null;
        }

        /// <summary>  
        /// DataTable扩展方法：将DataTable类型转化为指定类型的实体集合  
        /// </summary>  
        /// <typeparam name="T">实体类型</typeparam>  
        /// <returns></returns>  
        public static List<T> ToList<T>(this DataTable dt) where T : class, new()
        {
            return ToList<T>(dt, false);
        }

        /// <summary>  
        /// DataTable扩展方法：将DataTable类型转化为指定类型的实体集合  
        /// </summary>  
        /// <typeparam name="T">实体类型</typeparam>  
        /// <param name="dateTimeToString">是否需要将日期转换为字符串，默认为转换,值为true</param>  
        /// <returns></returns>  
        public static List<T> ToList<T>(this DataTable dt, bool dateTimeToString) where T : class, new()
        {
            List<T> list = new List<T>();

            if (dt != null)
            {
                List<PropertyInfo> infos = new List<PropertyInfo>();
                Array.ForEach<PropertyInfo>(typeof(T).GetProperties(), p =>
                {
                    if (dt.Columns.Contains(p.Name) == true)
                    {
                        infos.Add(p);
                    }
                });
                SetList<T>(list, infos, dt, dateTimeToString);
            }
            return list;
        }

        #region 私有方法

        private static void SetList<T>(List<T> list, List<PropertyInfo> infos, DataTable dt, bool dateTimeToString) where T : class, new()
        {
            foreach (DataRow dr in dt.Rows)
            {
                T model = new T();
                infos.ForEach(p =>
                {
                    if (dr[p.Name] != DBNull.Value)
                    {
                        object tempValue = dr[p.Name];
                        if (dr[p.Name].GetType() == typeof(DateTime) && dateTimeToString == true)
                        {
                            tempValue = dr[p.Name].ToString();
                        }
                        try
                        {
                            p.SetValue(model, tempValue, null);
                        }
                        catch { }
                    }
                });
                list.Add(model);
            }
        }
        #endregion
    }

    #endregion

    #region 枚举转成Javascript枚举通用方法

    /// <summary>
    /// 枚举转成Javascript
    /// </summary>
    public static class EnumExtensions
    {
        public static string ToScript(this Type enumType)
        {

            int[] values = (int[])Enum.GetValues(enumType);
            string[] names = Enum.GetNames(enumType);
            string[] pairs = new string[values.Length];

            for (int i = 0; i < values.Length; i++)
            {
                pairs[i] = names[i] + ": " + values[i];
            }

            return string.Format("var e{0}={{\n{1}\n}}", enumType.Name, string.Join(",\n", pairs));
        }

        public static Dictionary<string, string> ToDictionary(this Type enumType)
        {
            int[] values = (int[])Enum.GetValues(enumType);
            string[] names = Enum.GetNames(enumType);

            Dictionary<string, string> dic = new Dictionary<string, string>();

            for (int i = 0; i < values.Length; i++)
            {
                dic.Add(values[i].ToString(), names[i].ToString());
            }
            return dic;
        }
    }

    #endregion
}
